espressif/esp-idf/components/soc/esp32s2/register/soc/extmem_reg.h
/*
 * SPDX-FileCopyrightText: 2017-2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#ifndef _SOC_EXTMEM_REG_H_
#define _SOC_EXTMEM_REG_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc/soc.h"
#define EXTMEM_PRO_DCACHE_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x000)
/* EXTMEM_PRO_DCACHE_LOCK_DONE : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: The bit is used to indicate lock operation is finished.*/
#define EXTMEM_PRO_DCACHE_LOCK_DONE  (BIT(25))
#define EXTMEM_PRO_DCACHE_LOCK_DONE_M  (BIT(25))
#define EXTMEM_PRO_DCACHE_LOCK_DONE_V  0x1
#define EXTMEM_PRO_DCACHE_LOCK_DONE_S  25
/* EXTMEM_PRO_DCACHE_LOCK_ENA : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: The bit is used to enable lock operation. It will be cleared
 by hardware after lock operation done.*/
#define EXTMEM_PRO_DCACHE_LOCK_ENA  (BIT(24))
#define EXTMEM_PRO_DCACHE_LOCK_ENA_M  (BIT(24))
#define EXTMEM_PRO_DCACHE_LOCK_ENA_V  0x1
#define EXTMEM_PRO_DCACHE_LOCK_ENA_S  24
/* EXTMEM_PRO_DCACHE_UNLOCK_DONE : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: The bit is used to indicate unlock operation is finished.*/
#define EXTMEM_PRO_DCACHE_UNLOCK_DONE  (BIT(23))
#define EXTMEM_PRO_DCACHE_UNLOCK_DONE_M  (BIT(23))
#define EXTMEM_PRO_DCACHE_UNLOCK_DONE_V  0x1
#define EXTMEM_PRO_DCACHE_UNLOCK_DONE_S  23
/* EXTMEM_PRO_DCACHE_UNLOCK_ENA : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: The bit is used to enable unlock operation. It will be cleared
 by hardware after unlock operation done.*/
#define EXTMEM_PRO_DCACHE_UNLOCK_ENA  (BIT(22))
#define EXTMEM_PRO_DCACHE_UNLOCK_ENA_M  (BIT(22))
#define EXTMEM_PRO_DCACHE_UNLOCK_ENA_V  0x1
#define EXTMEM_PRO_DCACHE_UNLOCK_ENA_S  22
/* EXTMEM_PRO_DCACHE_PRELOAD_DONE : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: The bit is used to indicate preload operation is finished.*/
#define EXTMEM_PRO_DCACHE_PRELOAD_DONE  (BIT(21))
#define EXTMEM_PRO_DCACHE_PRELOAD_DONE_M  (BIT(21))
#define EXTMEM_PRO_DCACHE_PRELOAD_DONE_V  0x1
#define EXTMEM_PRO_DCACHE_PRELOAD_DONE_S  21
/* EXTMEM_PRO_DCACHE_PRELOAD_ENA : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: The bit is used to enable preload operation. It will be cleared
 by hardware after preload operation done.*/
#define EXTMEM_PRO_DCACHE_PRELOAD_ENA  (BIT(20))
#define EXTMEM_PRO_DCACHE_PRELOAD_ENA_M  (BIT(20))
#define EXTMEM_PRO_DCACHE_PRELOAD_ENA_V  0x1
#define EXTMEM_PRO_DCACHE_PRELOAD_ENA_S  20
/* EXTMEM_PRO_DCACHE_AUTOLOAD_DONE : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: The bit is used to indicate conditional-preload operation is finished.*/
#define EXTMEM_PRO_DCACHE_AUTOLOAD_DONE  (BIT(19))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_DONE_M  (BIT(19))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_DONE_V  0x1
#define EXTMEM_PRO_DCACHE_AUTOLOAD_DONE_S  19
/* EXTMEM_PRO_DCACHE_AUTOLOAD_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: The bit is used to enable and disable conditional-preload operation.
 It is combined with pre_dcache_autoload_done. 1: enable  0: disable.*/
#define EXTMEM_PRO_DCACHE_AUTOLOAD_ENA  (BIT(18))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_ENA_M  (BIT(18))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_ENA_V  0x1
#define EXTMEM_PRO_DCACHE_AUTOLOAD_ENA_S  18
/* EXTMEM_PRO_DCACHE_LOCK1_EN : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: The bit is used to enable pre-lock operation which is combined
 with PRO_DCACHE_LOCK1_ADDR_REG and PRO_DCACHE_LOCK1_SIZE_REG.*/
#define EXTMEM_PRO_DCACHE_LOCK1_EN  (BIT(15))
#define EXTMEM_PRO_DCACHE_LOCK1_EN_M  (BIT(15))
#define EXTMEM_PRO_DCACHE_LOCK1_EN_V  0x1
#define EXTMEM_PRO_DCACHE_LOCK1_EN_S  15
/* EXTMEM_PRO_DCACHE_LOCK0_EN : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: The bit is used to enable pre-lock operation which is combined
 with PRO_DCACHE_LOCK0_ADDR_REG and PRO_DCACHE_LOCK0_SIZE_REG.*/
#define EXTMEM_PRO_DCACHE_LOCK0_EN  (BIT(14))
#define EXTMEM_PRO_DCACHE_LOCK0_EN_M  (BIT(14))
#define EXTMEM_PRO_DCACHE_LOCK0_EN_V  0x1
#define EXTMEM_PRO_DCACHE_LOCK0_EN_S  14
/* EXTMEM_PRO_DCACHE_CLEAN_DONE : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: The bit is used to indicate clean operation is finished.*/
#define EXTMEM_PRO_DCACHE_CLEAN_DONE  (BIT(13))
#define EXTMEM_PRO_DCACHE_CLEAN_DONE_M  (BIT(13))
#define EXTMEM_PRO_DCACHE_CLEAN_DONE_V  0x1
#define EXTMEM_PRO_DCACHE_CLEAN_DONE_S  13
/* EXTMEM_PRO_DCACHE_CLEAN_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: The bit is used to enable clean operation. It will be cleared
 by hardware after clean operation done.*/
#define EXTMEM_PRO_DCACHE_CLEAN_ENA  (BIT(12))
#define EXTMEM_PRO_DCACHE_CLEAN_ENA_M  (BIT(12))
#define EXTMEM_PRO_DCACHE_CLEAN_ENA_V  0x1
#define EXTMEM_PRO_DCACHE_CLEAN_ENA_S  12
/* EXTMEM_PRO_DCACHE_FLUSH_DONE : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: The bit is used to indicate flush operation is finished.*/
#define EXTMEM_PRO_DCACHE_FLUSH_DONE  (BIT(11))
#define EXTMEM_PRO_DCACHE_FLUSH_DONE_M  (BIT(11))
#define EXTMEM_PRO_DCACHE_FLUSH_DONE_V  0x1
#define EXTMEM_PRO_DCACHE_FLUSH_DONE_S  11
/* EXTMEM_PRO_DCACHE_FLUSH_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: The bit is used to enable flush operation. It will be cleared
 by hardware after flush operation done.*/
#define EXTMEM_PRO_DCACHE_FLUSH_ENA  (BIT(10))
#define EXTMEM_PRO_DCACHE_FLUSH_ENA_M  (BIT(10))
#define EXTMEM_PRO_DCACHE_FLUSH_ENA_V  0x1
#define EXTMEM_PRO_DCACHE_FLUSH_ENA_S  10
/* EXTMEM_PRO_DCACHE_INVALIDATE_DONE : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The bit is used to indicate invalidate operation is finished.*/
#define EXTMEM_PRO_DCACHE_INVALIDATE_DONE  (BIT(9))
#define EXTMEM_PRO_DCACHE_INVALIDATE_DONE_M  (BIT(9))
#define EXTMEM_PRO_DCACHE_INVALIDATE_DONE_V  0x1
#define EXTMEM_PRO_DCACHE_INVALIDATE_DONE_S  9
/* EXTMEM_PRO_DCACHE_INVALIDATE_ENA : R/W ;bitpos:[8] ;default: 1'b1 ; */
/*description: The bit is used to enable invalidate operation. It will be cleared
 by hardware after invalidate operation done.*/
#define EXTMEM_PRO_DCACHE_INVALIDATE_ENA  (BIT(8))
#define EXTMEM_PRO_DCACHE_INVALIDATE_ENA_M  (BIT(8))
#define EXTMEM_PRO_DCACHE_INVALIDATE_ENA_V  0x1
#define EXTMEM_PRO_DCACHE_INVALIDATE_ENA_S  8
/* EXTMEM_PRO_DCACHE_BLOCKSIZE_MODE : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The bit is used to configure cache block size.0: 16 bytes  1: 32 bytes*/
#define EXTMEM_PRO_DCACHE_BLOCKSIZE_MODE  (BIT(3))
#define EXTMEM_PRO_DCACHE_BLOCKSIZE_MODE_M  (BIT(3))
#define EXTMEM_PRO_DCACHE_BLOCKSIZE_MODE_V  0x1
#define EXTMEM_PRO_DCACHE_BLOCKSIZE_MODE_S  3
/* EXTMEM_PRO_DCACHE_SETSIZE_MODE : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The bit is used to configure cache memory size.0: 8KB  1: 16KB*/
#define EXTMEM_PRO_DCACHE_SETSIZE_MODE  (BIT(2))
#define EXTMEM_PRO_DCACHE_SETSIZE_MODE_M  (BIT(2))
#define EXTMEM_PRO_DCACHE_SETSIZE_MODE_V  0x1
#define EXTMEM_PRO_DCACHE_SETSIZE_MODE_S  2
/* EXTMEM_PRO_DCACHE_ENABLE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bit is used to activate the data cache. 0: disable  1: enable*/
#define EXTMEM_PRO_DCACHE_ENABLE  (BIT(0))
#define EXTMEM_PRO_DCACHE_ENABLE_M  (BIT(0))
#define EXTMEM_PRO_DCACHE_ENABLE_V  0x1
#define EXTMEM_PRO_DCACHE_ENABLE_S  0

