espressif/esp-idf/components/soc/esp32s2/register/soc/extmem_reg.h
#define EXTMEM_PRO_DCACHE_CTRL1_REG          (DR_REG_EXTMEM_BASE + 0x004)
/* EXTMEM_PRO_DCACHE_MASK_BUS2 : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: The bit is used to disable dbus2  0: enable  1: disable*/
#define EXTMEM_PRO_DCACHE_MASK_BUS2  (BIT(2))
#define EXTMEM_PRO_DCACHE_MASK_BUS2_M  (BIT(2))
#define EXTMEM_PRO_DCACHE_MASK_BUS2_V  0x1
#define EXTMEM_PRO_DCACHE_MASK_BUS2_S  2
/* EXTMEM_PRO_DCACHE_MASK_BUS1 : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: The bit is used to disable dbus1  0: enable  1: disable*/
#define EXTMEM_PRO_DCACHE_MASK_BUS1  (BIT(1))
#define EXTMEM_PRO_DCACHE_MASK_BUS1_M  (BIT(1))
#define EXTMEM_PRO_DCACHE_MASK_BUS1_V  0x1
#define EXTMEM_PRO_DCACHE_MASK_BUS1_S  1
/* EXTMEM_PRO_DCACHE_MASK_BUS0 : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: The bit is used to disable dbus0  0: enable  1: disable*/
#define EXTMEM_PRO_DCACHE_MASK_BUS0  (BIT(0))
#define EXTMEM_PRO_DCACHE_MASK_BUS0_M  (BIT(0))
#define EXTMEM_PRO_DCACHE_MASK_BUS0_V  0x1
#define EXTMEM_PRO_DCACHE_MASK_BUS0_S  0
#define EXTMEM_PRO_DCACHE_MASK_DRAM0 EXTMEM_PRO_DCACHE_MASK_BUS0
#define EXTMEM_PRO_DCACHE_MASK_DRAM1 EXTMEM_PRO_DCACHE_MASK_BUS1
#define EXTMEM_PRO_DCACHE_MASK_DPORT EXTMEM_PRO_DCACHE_MASK_BUS2

#define EXTMEM_PRO_DCACHE_TAG_POWER_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x008)
/* EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_PU : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: The bit is used to power dcache tag memory down  0: follow  rtc_lslp_pd
  1: power up*/
#define EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_PU  (BIT(2))
#define EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_PU_M  (BIT(2))
#define EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_PU_V  0x1
#define EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_PU_S  2
/* EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_PD : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to power dcache tag memory down  0: follow  rtc_lslp_pd
  1: power down*/
#define EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_PD  (BIT(1))
#define EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_PD_M  (BIT(1))
#define EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_PD_V  0x1
#define EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_PD_S  1
/* EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_ON : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: The bit is used to close clock gating of dcache tag memory. 1:
 close gating  0: open clock gating.*/
#define EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_ON  (BIT(0))
#define EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_ON_M  (BIT(0))
#define EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_ON_V  0x1
#define EXTMEM_PRO_DCACHE_TAG_MEM_FORCE_ON_S  0

#define EXTMEM_PRO_DCACHE_LOCK0_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x00C)
/* EXTMEM_PRO_DCACHE_LOCK0_ADDR : R/W ;bitpos:[31:0] ;default: 10'h0 ; */
/*description: The bits are used to configure the first start virtual address
 of data locking  which is combined with PRO_DCACHE_LOCK0_SIZE_REG*/
#define EXTMEM_PRO_DCACHE_LOCK0_ADDR  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_LOCK0_ADDR_M  ((EXTMEM_PRO_DCACHE_LOCK0_ADDR_V)<<(EXTMEM_PRO_DCACHE_LOCK0_ADDR_S))
#define EXTMEM_PRO_DCACHE_LOCK0_ADDR_V  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_LOCK0_ADDR_S  0

#define EXTMEM_PRO_DCACHE_LOCK0_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x010)
/* EXTMEM_PRO_DCACHE_LOCK0_SIZE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The bits are used to configure the first length of data locking
  which is combined with PRO_DCACHE_LOCK0_ADDR_REG*/
#define EXTMEM_PRO_DCACHE_LOCK0_SIZE  0x0000FFFF
#define EXTMEM_PRO_DCACHE_LOCK0_SIZE_M  ((EXTMEM_PRO_DCACHE_LOCK0_SIZE_V)<<(EXTMEM_PRO_DCACHE_LOCK0_SIZE_S))
#define EXTMEM_PRO_DCACHE_LOCK0_SIZE_V  0xFFFF
#define EXTMEM_PRO_DCACHE_LOCK0_SIZE_S  0

#define EXTMEM_PRO_DCACHE_LOCK1_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x014)
/* EXTMEM_PRO_DCACHE_LOCK1_ADDR : R/W ;bitpos:[31:0] ;default: 10'h0 ; */
/*description: The bits are used to configure the second start virtual address
 of data locking  which is combined with PRO_DCACHE_LOCK1_SIZE_REG*/
#define EXTMEM_PRO_DCACHE_LOCK1_ADDR  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_LOCK1_ADDR_M  ((EXTMEM_PRO_DCACHE_LOCK1_ADDR_V)<<(EXTMEM_PRO_DCACHE_LOCK1_ADDR_S))
#define EXTMEM_PRO_DCACHE_LOCK1_ADDR_V  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_LOCK1_ADDR_S  0

#define EXTMEM_PRO_DCACHE_LOCK1_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x018)
/* EXTMEM_PRO_DCACHE_LOCK1_SIZE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The bits are used to configure the second length of data locking
  which is combined with PRO_DCACHE_LOCK1_ADDR_REG*/
#define EXTMEM_PRO_DCACHE_LOCK1_SIZE  0x0000FFFF
#define EXTMEM_PRO_DCACHE_LOCK1_SIZE_M  ((EXTMEM_PRO_DCACHE_LOCK1_SIZE_V)<<(EXTMEM_PRO_DCACHE_LOCK1_SIZE_S))
#define EXTMEM_PRO_DCACHE_LOCK1_SIZE_V  0xFFFF
#define EXTMEM_PRO_DCACHE_LOCK1_SIZE_S  0

#define EXTMEM_PRO_DCACHE_MEM_SYNC0_REG          (DR_REG_EXTMEM_BASE + 0x01C)
/* EXTMEM_PRO_DCACHE_MEMSYNC_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The bits are used to configure the start virtual address for
 invalidate  flush  clean  lock and unlock operations. The manual operations will be issued if the address is validate. The auto operations will be issued if the address is invalidate. It should be combined with PRO_DCACHE_MEM_SYNC1.*/
#define EXTMEM_PRO_DCACHE_MEMSYNC_ADDR  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_MEMSYNC_ADDR_M  ((EXTMEM_PRO_DCACHE_MEMSYNC_ADDR_V)<<(EXTMEM_PRO_DCACHE_MEMSYNC_ADDR_S))
#define EXTMEM_PRO_DCACHE_MEMSYNC_ADDR_V  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_MEMSYNC_ADDR_S  0

#define EXTMEM_PRO_DCACHE_MEM_SYNC1_REG          (DR_REG_EXTMEM_BASE + 0x020)
/* EXTMEM_PRO_DCACHE_MEMSYNC_SIZE : R/W ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: The bits are used to configure the length for invalidate  flush
  clean  lock and unlock operations. The manual operations will be issued if it is validate. The auto operations will be issued if it is invalidate. It should be combined with PRO_DCACHE_MEM_SYNC0.*/
#define EXTMEM_PRO_DCACHE_MEMSYNC_SIZE  0x0007FFFF
#define EXTMEM_PRO_DCACHE_MEMSYNC_SIZE_M  ((EXTMEM_PRO_DCACHE_MEMSYNC_SIZE_V)<<(EXTMEM_PRO_DCACHE_MEMSYNC_SIZE_S))
#define EXTMEM_PRO_DCACHE_MEMSYNC_SIZE_V  0x7FFFF
#define EXTMEM_PRO_DCACHE_MEMSYNC_SIZE_S  0

#define EXTMEM_PRO_DCACHE_PRELOAD_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x024)
/* EXTMEM_PRO_DCACHE_PRELOAD_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The bits are used to configure the start virtual address for
 manual pre-load operation. It should be combined with PRO_DCACHE_PRELOAD_SIZE_REG.*/
#define EXTMEM_PRO_DCACHE_PRELOAD_ADDR  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_PRELOAD_ADDR_M  ((EXTMEM_PRO_DCACHE_PRELOAD_ADDR_V)<<(EXTMEM_PRO_DCACHE_PRELOAD_ADDR_S))
#define EXTMEM_PRO_DCACHE_PRELOAD_ADDR_V  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_PRELOAD_ADDR_S  0

#define EXTMEM_PRO_DCACHE_PRELOAD_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x028)
/* EXTMEM_PRO_DCACHE_PRELOAD_ORDER : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: The bits are used to configure the direction of manual pre-load
 operation. 1: descending  0: ascending.*/
#define EXTMEM_PRO_DCACHE_PRELOAD_ORDER  (BIT(10))
#define EXTMEM_PRO_DCACHE_PRELOAD_ORDER_M  (BIT(10))
#define EXTMEM_PRO_DCACHE_PRELOAD_ORDER_V  0x1
#define EXTMEM_PRO_DCACHE_PRELOAD_ORDER_S  10
/* EXTMEM_PRO_DCACHE_PRELOAD_SIZE : R/W ;bitpos:[9:0] ;default: 10'h200 ; */
/*description: The bits are used to configure the length for manual pre-load
 operation.  It should be combined with PRO_DCACHE_PRELOAD_ADDR_REG..*/
#define EXTMEM_PRO_DCACHE_PRELOAD_SIZE  0x000003FF
#define EXTMEM_PRO_DCACHE_PRELOAD_SIZE_M  ((EXTMEM_PRO_DCACHE_PRELOAD_SIZE_V)<<(EXTMEM_PRO_DCACHE_PRELOAD_SIZE_S))
#define EXTMEM_PRO_DCACHE_PRELOAD_SIZE_V  0x3FF
#define EXTMEM_PRO_DCACHE_PRELOAD_SIZE_S  0

#define EXTMEM_PRO_DCACHE_AUTOLOAD_CFG_REG          (DR_REG_EXTMEM_BASE + 0x02C)
/* EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: The bits are used to enable the first section for conditional
 pre-load operation.*/
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_ENA  (BIT(9))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_ENA_M  (BIT(9))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_ENA_V  0x1
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_ENA_S  9
/* EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The bits are used to enable the second section for conditional
 pre-load operation.*/
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_ENA  (BIT(8))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_ENA_M  (BIT(8))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_ENA_V  0x1
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_ENA_S  8
/* EXTMEM_PRO_DCACHE_AUTOLOAD_SIZE : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: The bits are used to configure the numbers of the cache block
 for the issuing conditional pre-load operation.*/
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SIZE  0x00000003
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SIZE_M  ((EXTMEM_PRO_DCACHE_AUTOLOAD_SIZE_V)<<(EXTMEM_PRO_DCACHE_AUTOLOAD_SIZE_S))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SIZE_V  0x3
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SIZE_S  6
/* EXTMEM_PRO_DCACHE_AUTOLOAD_RQST : R/W ;bitpos:[5:4] ;default: 1'b0 ; */
/*description: The bits are used to configure trigger conditions for conditional
 pre-load. 0/3: cache miss  1: cache hit  2: both cache miss and hit.*/
#define EXTMEM_PRO_DCACHE_AUTOLOAD_RQST  0x00000003
#define EXTMEM_PRO_DCACHE_AUTOLOAD_RQST_M  ((EXTMEM_PRO_DCACHE_AUTOLOAD_RQST_V)<<(EXTMEM_PRO_DCACHE_AUTOLOAD_RQST_S))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_RQST_V  0x3
#define EXTMEM_PRO_DCACHE_AUTOLOAD_RQST_S  4
/* EXTMEM_PRO_DCACHE_AUTOLOAD_ORDER : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The bits are used to configure the direction of conditional pre-load
 operation. 1: descending  0: ascending.*/
#define EXTMEM_PRO_DCACHE_AUTOLOAD_ORDER  (BIT(3))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_ORDER_M  (BIT(3))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_ORDER_V  0x1
#define EXTMEM_PRO_DCACHE_AUTOLOAD_ORDER_S  3
/* EXTMEM_PRO_DCACHE_AUTOLOAD_STEP : R/W ;bitpos:[2:1] ;default: 2'b0 ; */
/*description: Reserved.*/
#define EXTMEM_PRO_DCACHE_AUTOLOAD_STEP  0x00000003
#define EXTMEM_PRO_DCACHE_AUTOLOAD_STEP_M  ((EXTMEM_PRO_DCACHE_AUTOLOAD_STEP_V)<<(EXTMEM_PRO_DCACHE_AUTOLOAD_STEP_S))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_STEP_V  0x3
#define EXTMEM_PRO_DCACHE_AUTOLOAD_STEP_S  1
/* EXTMEM_PRO_DCACHE_AUTOLOAD_MODE : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: Reserved.*/
#define EXTMEM_PRO_DCACHE_AUTOLOAD_MODE  (BIT(0))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_MODE_M  (BIT(0))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_MODE_V  0x1
#define EXTMEM_PRO_DCACHE_AUTOLOAD_MODE_S  0

#define EXTMEM_PRO_DCACHE_AUTOLOAD_SECTION0_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x030)
/* EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The bits are used to configure the start virtual address of the
 first section for conditional pre-load operation. It should be combined with pro_dcache_autoload_sct0_ena.*/
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_ADDR  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_ADDR_M  ((EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_ADDR_V)<<(EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_ADDR_S))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_ADDR_V  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_ADDR_S  0

#define EXTMEM_PRO_DCACHE_AUTOLOAD_SECTION0_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x034)
/* EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_SIZE : R/W ;bitpos:[23:0] ;default: 24'h8000 ; */
/*description: The bits are used to configure the length of the first section
 for conditional pre-load operation. It should be combined with pro_dcache_autoload_sct0_ena.*/
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_SIZE  0x00FFFFFF
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_SIZE_M  ((EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_SIZE_V)<<(EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_SIZE_S))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_SIZE_V  0xFFFFFF
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT0_SIZE_S  0

#define EXTMEM_PRO_DCACHE_AUTOLOAD_SECTION1_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x038)
/* EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The bits are used to configure the start virtual address of the
 second section for conditional pre-load operation. It should be combined with pro_dcache_autoload_sct1_ena.*/
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_ADDR  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_ADDR_M  ((EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_ADDR_V)<<(EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_ADDR_S))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_ADDR_V  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_ADDR_S  0

