espressif/esp-idf/components/soc/esp32s2/register/soc/extmem_reg.h
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SECTION1_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x03C)
/* EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_SIZE : R/W ;bitpos:[23:0] ;default: 24'h8000 ; */
/*description: The bits are used to configure the length of the second section
 for conditional pre-load operation. It should be combined with pro_dcache_autoload_sct1_ena.*/
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_SIZE  0x00FFFFFF
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_SIZE_M  ((EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_SIZE_V)<<(EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_SIZE_S))
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_SIZE_V  0xFFFFFF
#define EXTMEM_PRO_DCACHE_AUTOLOAD_SCT1_SIZE_S  0

#define EXTMEM_PRO_ICACHE_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x040)
/* EXTMEM_PRO_ICACHE_LOCK_DONE : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: The bit is used to indicate lock operation is finished.*/
#define EXTMEM_PRO_ICACHE_LOCK_DONE  (BIT(25))
#define EXTMEM_PRO_ICACHE_LOCK_DONE_M  (BIT(25))
#define EXTMEM_PRO_ICACHE_LOCK_DONE_V  0x1
#define EXTMEM_PRO_ICACHE_LOCK_DONE_S  25
/* EXTMEM_PRO_ICACHE_LOCK_ENA : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: The bit is used to enable lock operation. It will be cleared
 by hardware after lock operation done.*/
#define EXTMEM_PRO_ICACHE_LOCK_ENA  (BIT(24))
#define EXTMEM_PRO_ICACHE_LOCK_ENA_M  (BIT(24))
#define EXTMEM_PRO_ICACHE_LOCK_ENA_V  0x1
#define EXTMEM_PRO_ICACHE_LOCK_ENA_S  24
/* EXTMEM_PRO_ICACHE_UNLOCK_DONE : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: The bit is used to indicate unlock operation is finished.*/
#define EXTMEM_PRO_ICACHE_UNLOCK_DONE  (BIT(23))
#define EXTMEM_PRO_ICACHE_UNLOCK_DONE_M  (BIT(23))
#define EXTMEM_PRO_ICACHE_UNLOCK_DONE_V  0x1
#define EXTMEM_PRO_ICACHE_UNLOCK_DONE_S  23
/* EXTMEM_PRO_ICACHE_UNLOCK_ENA : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: The bit is used to enable unlock operation. It will be cleared
 by hardware after unlock operation done.*/
#define EXTMEM_PRO_ICACHE_UNLOCK_ENA  (BIT(22))
#define EXTMEM_PRO_ICACHE_UNLOCK_ENA_M  (BIT(22))
#define EXTMEM_PRO_ICACHE_UNLOCK_ENA_V  0x1
#define EXTMEM_PRO_ICACHE_UNLOCK_ENA_S  22
/* EXTMEM_PRO_ICACHE_PRELOAD_DONE : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: The bit is used to indicate preload operation is finished.*/
#define EXTMEM_PRO_ICACHE_PRELOAD_DONE  (BIT(21))
#define EXTMEM_PRO_ICACHE_PRELOAD_DONE_M  (BIT(21))
#define EXTMEM_PRO_ICACHE_PRELOAD_DONE_V  0x1
#define EXTMEM_PRO_ICACHE_PRELOAD_DONE_S  21
/* EXTMEM_PRO_ICACHE_PRELOAD_ENA : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: The bit is used to enable preload operation. It will be cleared
 by hardware after preload operation done.*/
#define EXTMEM_PRO_ICACHE_PRELOAD_ENA  (BIT(20))
#define EXTMEM_PRO_ICACHE_PRELOAD_ENA_M  (BIT(20))
#define EXTMEM_PRO_ICACHE_PRELOAD_ENA_V  0x1
#define EXTMEM_PRO_ICACHE_PRELOAD_ENA_S  20
/* EXTMEM_PRO_ICACHE_AUTOLOAD_DONE : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: The bit is used to indicate conditional-preload operation is finished.*/
#define EXTMEM_PRO_ICACHE_AUTOLOAD_DONE  (BIT(19))
#define EXTMEM_PRO_ICACHE_AUTOLOAD_DONE_M  (BIT(19))
#define EXTMEM_PRO_ICACHE_AUTOLOAD_DONE_V  0x1
#define EXTMEM_PRO_ICACHE_AUTOLOAD_DONE_S  19
/* EXTMEM_PRO_ICACHE_AUTOLOAD_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: The bit is used to enable and disable conditional-preload operation.
 It is combined with pre_dcache_autoload_done. 1: enable  0: disable.*/
#define EXTMEM_PRO_ICACHE_AUTOLOAD_ENA  (BIT(18))
#define EXTMEM_PRO_ICACHE_AUTOLOAD_ENA_M  (BIT(18))
#define EXTMEM_PRO_ICACHE_AUTOLOAD_ENA_V  0x1
#define EXTMEM_PRO_ICACHE_AUTOLOAD_ENA_S  18
/* EXTMEM_PRO_ICACHE_LOCK1_EN : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: The bit is used to enable pre-lock operation which is combined
 with PRO_ICACHE_LOCK1_ADDR_REG and PRO_ICACHE_LOCK1_SIZE_REG.*/
#define EXTMEM_PRO_ICACHE_LOCK1_EN  (BIT(15))
#define EXTMEM_PRO_ICACHE_LOCK1_EN_M  (BIT(15))
#define EXTMEM_PRO_ICACHE_LOCK1_EN_V  0x1
#define EXTMEM_PRO_ICACHE_LOCK1_EN_S  15
/* EXTMEM_PRO_ICACHE_LOCK0_EN : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: The bit is used to enable pre-lock operation which is combined
 with PRO_ICACHE_LOCK0_ADDR_REG and PRO_ICACHE_LOCK0_SIZE_REG.*/
#define EXTMEM_PRO_ICACHE_LOCK0_EN  (BIT(14))
#define EXTMEM_PRO_ICACHE_LOCK0_EN_M  (BIT(14))
#define EXTMEM_PRO_ICACHE_LOCK0_EN_V  0x1
#define EXTMEM_PRO_ICACHE_LOCK0_EN_S  14
/* EXTMEM_PRO_ICACHE_INVALIDATE_DONE : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The bit is used to indicate invalidate operation is finished.*/
#define EXTMEM_PRO_ICACHE_INVALIDATE_DONE  (BIT(9))
#define EXTMEM_PRO_ICACHE_INVALIDATE_DONE_M  (BIT(9))
#define EXTMEM_PRO_ICACHE_INVALIDATE_DONE_V  0x1
#define EXTMEM_PRO_ICACHE_INVALIDATE_DONE_S  9
/* EXTMEM_PRO_ICACHE_INVALIDATE_ENA : R/W ;bitpos:[8] ;default: 1'b1 ; */
/*description: The bit is used to enable invalidate operation. It will be cleared
 by hardware after invalidate operation done.*/
#define EXTMEM_PRO_ICACHE_INVALIDATE_ENA  (BIT(8))
#define EXTMEM_PRO_ICACHE_INVALIDATE_ENA_M  (BIT(8))
#define EXTMEM_PRO_ICACHE_INVALIDATE_ENA_V  0x1
#define EXTMEM_PRO_ICACHE_INVALIDATE_ENA_S  8
/* EXTMEM_PRO_ICACHE_BLOCKSIZE_MODE : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The bit is used to configure cache block size.0: 16 bytes  1: 32 bytes*/
#define EXTMEM_PRO_ICACHE_BLOCKSIZE_MODE  (BIT(3))
#define EXTMEM_PRO_ICACHE_BLOCKSIZE_MODE_M  (BIT(3))
#define EXTMEM_PRO_ICACHE_BLOCKSIZE_MODE_V  0x1
#define EXTMEM_PRO_ICACHE_BLOCKSIZE_MODE_S  3
/* EXTMEM_PRO_ICACHE_SETSIZE_MODE : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The bit is used to configure cache memory size.0: 8KB  1: 16KB*/
#define EXTMEM_PRO_ICACHE_SETSIZE_MODE  (BIT(2))
#define EXTMEM_PRO_ICACHE_SETSIZE_MODE_M  (BIT(2))
#define EXTMEM_PRO_ICACHE_SETSIZE_MODE_V  0x1
#define EXTMEM_PRO_ICACHE_SETSIZE_MODE_S  2
/* EXTMEM_PRO_ICACHE_ENABLE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bit is used to activate the data cache. 0: disable  1: enable*/
#define EXTMEM_PRO_ICACHE_ENABLE  (BIT(0))
#define EXTMEM_PRO_ICACHE_ENABLE_M  (BIT(0))
#define EXTMEM_PRO_ICACHE_ENABLE_V  0x1
#define EXTMEM_PRO_ICACHE_ENABLE_S  0

#define EXTMEM_PRO_ICACHE_CTRL1_REG          (DR_REG_EXTMEM_BASE + 0x044)
/* EXTMEM_PRO_ICACHE_MASK_BUS2 : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: The bit is used to disable ibus2  0: enable  1: disable*/
#define EXTMEM_PRO_ICACHE_MASK_BUS2  (BIT(2))
#define EXTMEM_PRO_ICACHE_MASK_BUS2_M  (BIT(2))
#define EXTMEM_PRO_ICACHE_MASK_BUS2_V  0x1
#define EXTMEM_PRO_ICACHE_MASK_BUS2_S  2
/* EXTMEM_PRO_ICACHE_MASK_BUS1 : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: The bit is used to disable ibus1  0: enable  1: disable*/
#define EXTMEM_PRO_ICACHE_MASK_BUS1  (BIT(1))
#define EXTMEM_PRO_ICACHE_MASK_BUS1_M  (BIT(1))
#define EXTMEM_PRO_ICACHE_MASK_BUS1_V  0x1
#define EXTMEM_PRO_ICACHE_MASK_BUS1_S  1
/* EXTMEM_PRO_ICACHE_MASK_BUS0 : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: The bit is used to disable ibus0  0: enable  1: disable*/
#define EXTMEM_PRO_ICACHE_MASK_BUS0  (BIT(0))
#define EXTMEM_PRO_ICACHE_MASK_BUS0_M  (BIT(0))
#define EXTMEM_PRO_ICACHE_MASK_BUS0_V  0x1
#define EXTMEM_PRO_ICACHE_MASK_BUS0_S  0
#define EXTMEM_PRO_ICACHE_MASK_IRAM0 EXTMEM_PRO_ICACHE_MASK_BUS0
#define EXTMEM_PRO_ICACHE_MASK_IRAM1 EXTMEM_PRO_ICACHE_MASK_BUS1
#define EXTMEM_PRO_ICACHE_MASK_DROM0 EXTMEM_PRO_ICACHE_MASK_BUS2

#define EXTMEM_PRO_ICACHE_TAG_POWER_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x048)
/* EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_PU : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: The bit is used to power icache tag memory down  0: follow rtc_lslp  1: power up*/
#define EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_PU  (BIT(2))
#define EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_PU_M  (BIT(2))
#define EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_PU_V  0x1
#define EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_PU_S  2
/* EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_PD : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to power icache tag memory down  0: follow rtc_lslp
  1: power down*/
#define EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_PD  (BIT(1))
#define EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_PD_M  (BIT(1))
#define EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_PD_V  0x1
#define EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_PD_S  1
/* EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_ON : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: The bit is used to close clock gating of icache tag memory. 1:
 close gating  0: open clock gating.*/
#define EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_ON  (BIT(0))
#define EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_ON_M  (BIT(0))
#define EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_ON_V  0x1
#define EXTMEM_PRO_ICACHE_TAG_MEM_FORCE_ON_S  0

#define EXTMEM_PRO_ICACHE_LOCK0_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x04C)
/* EXTMEM_PRO_ICACHE_LOCK0_ADDR : R/W ;bitpos:[31:0] ;default: 10'h0 ; */
/*description: The bits are used to configure the first start virtual address
 of data locking  which is combined with PRO_ICACHE_LOCK0_SIZE_REG*/
#define EXTMEM_PRO_ICACHE_LOCK0_ADDR  0xFFFFFFFF
#define EXTMEM_PRO_ICACHE_LOCK0_ADDR_M  ((EXTMEM_PRO_ICACHE_LOCK0_ADDR_V)<<(EXTMEM_PRO_ICACHE_LOCK0_ADDR_S))
#define EXTMEM_PRO_ICACHE_LOCK0_ADDR_V  0xFFFFFFFF
#define EXTMEM_PRO_ICACHE_LOCK0_ADDR_S  0

#define EXTMEM_PRO_ICACHE_LOCK0_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x050)
/* EXTMEM_PRO_ICACHE_LOCK0_SIZE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The bits are used to configure the first length of data locking
  which is combined with PRO_ICACHE_LOCK0_ADDR_REG*/
#define EXTMEM_PRO_ICACHE_LOCK0_SIZE  0x0000FFFF
#define EXTMEM_PRO_ICACHE_LOCK0_SIZE_M  ((EXTMEM_PRO_ICACHE_LOCK0_SIZE_V)<<(EXTMEM_PRO_ICACHE_LOCK0_SIZE_S))
#define EXTMEM_PRO_ICACHE_LOCK0_SIZE_V  0xFFFF
#define EXTMEM_PRO_ICACHE_LOCK0_SIZE_S  0

