espressif/esp-idf/components/soc/esp32s2/register/soc/extmem_reg.h
#define EXTMEM_DC_PRELOAD_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0AC)
/* EXTMEM_DC_PRELOAD_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The bits are used to count the number of issued pre-load which
 include manual pre-load and conditional pre-load.*/
#define EXTMEM_DC_PRELOAD_CNT  0x0000FFFF
#define EXTMEM_DC_PRELOAD_CNT_M  ((EXTMEM_DC_PRELOAD_CNT_V)<<(EXTMEM_DC_PRELOAD_CNT_S))
#define EXTMEM_DC_PRELOAD_CNT_V  0xFFFF
#define EXTMEM_DC_PRELOAD_CNT_S  0

#define EXTMEM_DC_PRELOAD_EVICT_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0B0)
/* EXTMEM_DC_PRELOAD_EVICT_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The bits are used to count the number of cache evictions by pre-load
 which include manual pre-load and conditional pre-load.*/
#define EXTMEM_DC_PRELOAD_EVICT_CNT  0x0000FFFF
#define EXTMEM_DC_PRELOAD_EVICT_CNT_M  ((EXTMEM_DC_PRELOAD_EVICT_CNT_V)<<(EXTMEM_DC_PRELOAD_EVICT_CNT_S))
#define EXTMEM_DC_PRELOAD_EVICT_CNT_V  0xFFFF
#define EXTMEM_DC_PRELOAD_EVICT_CNT_S  0

#define EXTMEM_DC_PRELOAD_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0B4)
/* EXTMEM_DC_PRELOAD_MISS_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The bits are used to count the number of missed pre-load which
 include manual pre-load and conditional pre-load.*/
#define EXTMEM_DC_PRELOAD_MISS_CNT  0x0000FFFF
#define EXTMEM_DC_PRELOAD_MISS_CNT_M  ((EXTMEM_DC_PRELOAD_MISS_CNT_V)<<(EXTMEM_DC_PRELOAD_MISS_CNT_S))
#define EXTMEM_DC_PRELOAD_MISS_CNT_V  0xFFFF
#define EXTMEM_DC_PRELOAD_MISS_CNT_S  0

#define EXTMEM_DBUS2_ABANDON_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0B8)
/* EXTMEM_DBUS2_ABANDON_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The bits are used to count the number of the abandoned dbus2 access.*/
#define EXTMEM_DBUS2_ABANDON_CNT  0x0000FFFF
#define EXTMEM_DBUS2_ABANDON_CNT_M  ((EXTMEM_DBUS2_ABANDON_CNT_V)<<(EXTMEM_DBUS2_ABANDON_CNT_S))
#define EXTMEM_DBUS2_ABANDON_CNT_V  0xFFFF
#define EXTMEM_DBUS2_ABANDON_CNT_S  0

#define EXTMEM_DBUS1_ABANDON_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0BC)
/* EXTMEM_DBUS1_ABANDON_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The bits are used to count the number of the abandoned dbus1 access.*/
#define EXTMEM_DBUS1_ABANDON_CNT  0x0000FFFF
#define EXTMEM_DBUS1_ABANDON_CNT_M  ((EXTMEM_DBUS1_ABANDON_CNT_V)<<(EXTMEM_DBUS1_ABANDON_CNT_S))
#define EXTMEM_DBUS1_ABANDON_CNT_V  0xFFFF
#define EXTMEM_DBUS1_ABANDON_CNT_S  0

#define EXTMEM_DBUS0_ABANDON_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0C0)
/* EXTMEM_DBUS0_ABANDON_CNT : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The bits are used to count the number of the abandoned dbus0 access.*/
#define EXTMEM_DBUS0_ABANDON_CNT  0x0000FFFF
#define EXTMEM_DBUS0_ABANDON_CNT_M  ((EXTMEM_DBUS0_ABANDON_CNT_V)<<(EXTMEM_DBUS0_ABANDON_CNT_S))
#define EXTMEM_DBUS0_ABANDON_CNT_V  0xFFFF
#define EXTMEM_DBUS0_ABANDON_CNT_S  0

#define EXTMEM_DBUS2_ACS_WB_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0C4)
/* EXTMEM_DBUS2_ACS_WB_CNT : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: The bits are used to count the number of cache evictions by dbus2 access cache.*/
#define EXTMEM_DBUS2_ACS_WB_CNT  0x000FFFFF
#define EXTMEM_DBUS2_ACS_WB_CNT_M  ((EXTMEM_DBUS2_ACS_WB_CNT_V)<<(EXTMEM_DBUS2_ACS_WB_CNT_S))
#define EXTMEM_DBUS2_ACS_WB_CNT_V  0xFFFFF
#define EXTMEM_DBUS2_ACS_WB_CNT_S  0

#define EXTMEM_DBUS1_ACS_WB_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0C8)
/* EXTMEM_DBUS1_ACS_WB_CNT : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: The bits are used to count the number of cache evictions by dbus1 access cache.*/
#define EXTMEM_DBUS1_ACS_WB_CNT  0x000FFFFF
#define EXTMEM_DBUS1_ACS_WB_CNT_M  ((EXTMEM_DBUS1_ACS_WB_CNT_V)<<(EXTMEM_DBUS1_ACS_WB_CNT_S))
#define EXTMEM_DBUS1_ACS_WB_CNT_V  0xFFFFF
#define EXTMEM_DBUS1_ACS_WB_CNT_S  0

#define EXTMEM_DBUS0_ACS_WB_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0CC)
/* EXTMEM_DBUS0_ACS_WB_CNT : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: The bits are used to count the number of cache evictions by dbus0 access cache.*/
#define EXTMEM_DBUS0_ACS_WB_CNT  0x000FFFFF
#define EXTMEM_DBUS0_ACS_WB_CNT_M  ((EXTMEM_DBUS0_ACS_WB_CNT_V)<<(EXTMEM_DBUS0_ACS_WB_CNT_S))
#define EXTMEM_DBUS0_ACS_WB_CNT_V  0xFFFFF
#define EXTMEM_DBUS0_ACS_WB_CNT_S  0

#define EXTMEM_DBUS2_ACS_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0D0)
/* EXTMEM_DBUS2_ACS_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The bits are used to count the number of the cache miss caused by dbus2 access.*/
#define EXTMEM_DBUS2_ACS_MISS_CNT  0xFFFFFFFF
#define EXTMEM_DBUS2_ACS_MISS_CNT_M  ((EXTMEM_DBUS2_ACS_MISS_CNT_V)<<(EXTMEM_DBUS2_ACS_MISS_CNT_S))
#define EXTMEM_DBUS2_ACS_MISS_CNT_V  0xFFFFFFFF
#define EXTMEM_DBUS2_ACS_MISS_CNT_S  0

#define EXTMEM_DBUS1_ACS_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0D4)
/* EXTMEM_DBUS1_ACS_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The bits are used to count the number of the cache miss caused by dbus1 access.*/
#define EXTMEM_DBUS1_ACS_MISS_CNT  0xFFFFFFFF
#define EXTMEM_DBUS1_ACS_MISS_CNT_M  ((EXTMEM_DBUS1_ACS_MISS_CNT_V)<<(EXTMEM_DBUS1_ACS_MISS_CNT_S))
#define EXTMEM_DBUS1_ACS_MISS_CNT_V  0xFFFFFFFF
#define EXTMEM_DBUS1_ACS_MISS_CNT_S  0

#define EXTMEM_DBUS0_ACS_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0D8)
/* EXTMEM_DBUS0_ACS_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The bits are used to count the number of the cache miss caused by dbus0 access.*/
#define EXTMEM_DBUS0_ACS_MISS_CNT  0xFFFFFFFF
#define EXTMEM_DBUS0_ACS_MISS_CNT_M  ((EXTMEM_DBUS0_ACS_MISS_CNT_V)<<(EXTMEM_DBUS0_ACS_MISS_CNT_S))
#define EXTMEM_DBUS0_ACS_MISS_CNT_V  0xFFFFFFFF
#define EXTMEM_DBUS0_ACS_MISS_CNT_S  0

#define EXTMEM_DBUS2_ACS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0DC)
/* EXTMEM_DBUS2_ACS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The bits are used to count the number of dbus2 access dcache.*/
#define EXTMEM_DBUS2_ACS_CNT  0xFFFFFFFF
#define EXTMEM_DBUS2_ACS_CNT_M  ((EXTMEM_DBUS2_ACS_CNT_V)<<(EXTMEM_DBUS2_ACS_CNT_S))
#define EXTMEM_DBUS2_ACS_CNT_V  0xFFFFFFFF
#define EXTMEM_DBUS2_ACS_CNT_S  0

