espressif/esp-idf/components/soc/esp32s2/register/soc/extmem_reg.h
#define EXTMEM_DBUS1_ACS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0E0)
/* EXTMEM_DBUS1_ACS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The bits are used to count the number of dbus1 access dcache.*/
#define EXTMEM_DBUS1_ACS_CNT  0xFFFFFFFF
#define EXTMEM_DBUS1_ACS_CNT_M  ((EXTMEM_DBUS1_ACS_CNT_V)<<(EXTMEM_DBUS1_ACS_CNT_S))
#define EXTMEM_DBUS1_ACS_CNT_V  0xFFFFFFFF
#define EXTMEM_DBUS1_ACS_CNT_S  0

#define EXTMEM_DBUS0_ACS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x0E4)
/* EXTMEM_DBUS0_ACS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The bits are used to count the number of dbus0 access dcache.*/
#define EXTMEM_DBUS0_ACS_CNT  0xFFFFFFFF
#define EXTMEM_DBUS0_ACS_CNT_M  ((EXTMEM_DBUS0_ACS_CNT_V)<<(EXTMEM_DBUS0_ACS_CNT_S))
#define EXTMEM_DBUS0_ACS_CNT_V  0xFFFFFFFF
#define EXTMEM_DBUS0_ACS_CNT_S  0

#define EXTMEM_CACHE_DBG_INT_ENA_REG          (DR_REG_EXTMEM_BASE + 0x0E8)
/* EXTMEM_MMU_ENTRY_FAULT_INT_ENA : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by mmu entry fault.*/
#define EXTMEM_MMU_ENTRY_FAULT_INT_ENA  (BIT(19))
#define EXTMEM_MMU_ENTRY_FAULT_INT_ENA_M  (BIT(19))
#define EXTMEM_MMU_ENTRY_FAULT_INT_ENA_V  0x1
#define EXTMEM_MMU_ENTRY_FAULT_INT_ENA_S  19
/* EXTMEM_DCACHE_SET_LOCK_ILG_INT_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by illegal writing lock registers
 of dcache while dcache is busy to issue lock sync or pre-load operations.*/
#define EXTMEM_DCACHE_SET_LOCK_ILG_INT_ENA  (BIT(18))
#define EXTMEM_DCACHE_SET_LOCK_ILG_INT_ENA_M  (BIT(18))
#define EXTMEM_DCACHE_SET_LOCK_ILG_INT_ENA_V  0x1
#define EXTMEM_DCACHE_SET_LOCK_ILG_INT_ENA_S  18
/* EXTMEM_DCACHE_SET_SYNC_ILG_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by illegal writing sync registers
 of dcache while dcache is busy to issue lock sync and pre-load operations.*/
#define EXTMEM_DCACHE_SET_SYNC_ILG_INT_ENA  (BIT(17))
#define EXTMEM_DCACHE_SET_SYNC_ILG_INT_ENA_M  (BIT(17))
#define EXTMEM_DCACHE_SET_SYNC_ILG_INT_ENA_V  0x1
#define EXTMEM_DCACHE_SET_SYNC_ILG_INT_ENA_S  17
/* EXTMEM_DCACHE_SET_PRELOAD_ILG_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by illegal writing preload
 registers of dcache while dcache is busy to issue lock sync and pre-load operations.*/
#define EXTMEM_DCACHE_SET_PRELOAD_ILG_INT_ENA  (BIT(16))
#define EXTMEM_DCACHE_SET_PRELOAD_ILG_INT_ENA_M  (BIT(16))
#define EXTMEM_DCACHE_SET_PRELOAD_ILG_INT_ENA_V  0x1
#define EXTMEM_DCACHE_SET_PRELOAD_ILG_INT_ENA_S  16
/* EXTMEM_DCACHE_REJECT_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by authentication fail.*/
#define EXTMEM_DCACHE_REJECT_INT_ENA  (BIT(15))
#define EXTMEM_DCACHE_REJECT_INT_ENA_M  (BIT(15))
#define EXTMEM_DCACHE_REJECT_INT_ENA_V  0x1
#define EXTMEM_DCACHE_REJECT_INT_ENA_S  15
/* EXTMEM_DCACHE_WRITE_FLASH_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by dcache trying to write flash.*/
#define EXTMEM_DCACHE_WRITE_FLASH_INT_ENA  (BIT(14))
#define EXTMEM_DCACHE_WRITE_FLASH_INT_ENA_M  (BIT(14))
#define EXTMEM_DCACHE_WRITE_FLASH_INT_ENA_V  0x1
#define EXTMEM_DCACHE_WRITE_FLASH_INT_ENA_S  14
/* EXTMEM_DC_PRELOAD_SIZE_FAULT_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by manual pre-load configurations fault.*/
#define EXTMEM_DC_PRELOAD_SIZE_FAULT_INT_ENA  (BIT(13))
#define EXTMEM_DC_PRELOAD_SIZE_FAULT_INT_ENA_M  (BIT(13))
#define EXTMEM_DC_PRELOAD_SIZE_FAULT_INT_ENA_V  0x1
#define EXTMEM_DC_PRELOAD_SIZE_FAULT_INT_ENA_S  13
/* EXTMEM_DC_SYNC_SIZE_FAULT_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by manual sync configurations fault.*/
#define EXTMEM_DC_SYNC_SIZE_FAULT_INT_ENA  (BIT(12))
#define EXTMEM_DC_SYNC_SIZE_FAULT_INT_ENA_M  (BIT(12))
#define EXTMEM_DC_SYNC_SIZE_FAULT_INT_ENA_V  0x1
#define EXTMEM_DC_SYNC_SIZE_FAULT_INT_ENA_S  12
/* EXTMEM_DBUS_CNT_OVF_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by dbus counter overflow.*/
#define EXTMEM_DBUS_CNT_OVF_INT_ENA  (BIT(11))
#define EXTMEM_DBUS_CNT_OVF_INT_ENA_M  (BIT(11))
#define EXTMEM_DBUS_CNT_OVF_INT_ENA_V  0x1
#define EXTMEM_DBUS_CNT_OVF_INT_ENA_S  11
/* EXTMEM_DBUS_ACS_MSK_DC_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by cpu access dcache while
 the corresponding dbus is disabled which include speculative access.*/
#define EXTMEM_DBUS_ACS_MSK_DC_INT_ENA  (BIT(10))
#define EXTMEM_DBUS_ACS_MSK_DC_INT_ENA_M  (BIT(10))
#define EXTMEM_DBUS_ACS_MSK_DC_INT_ENA_V  0x1
#define EXTMEM_DBUS_ACS_MSK_DC_INT_ENA_S  10
/* EXTMEM_ICACHE_SET_LOCK_ILG_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by illegal writing lock registers
 of icache while icache is busy to issue lock sync or pre-load operations.*/
#define EXTMEM_ICACHE_SET_LOCK_ILG_INT_ENA  (BIT(9))
#define EXTMEM_ICACHE_SET_LOCK_ILG_INT_ENA_M  (BIT(9))
#define EXTMEM_ICACHE_SET_LOCK_ILG_INT_ENA_V  0x1
#define EXTMEM_ICACHE_SET_LOCK_ILG_INT_ENA_S  9
/* EXTMEM_ICACHE_SET_SYNC_ILG_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by illegal writing sync registers
 of icache while icache is busy to issue lock sync and pre-load operations.*/
#define EXTMEM_ICACHE_SET_SYNC_ILG_INT_ENA  (BIT(8))
#define EXTMEM_ICACHE_SET_SYNC_ILG_INT_ENA_M  (BIT(8))
#define EXTMEM_ICACHE_SET_SYNC_ILG_INT_ENA_V  0x1
#define EXTMEM_ICACHE_SET_SYNC_ILG_INT_ENA_S  8
/* EXTMEM_ICACHE_SET_PRELOAD_ILG_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by illegal writing preload
 registers of icache while icache is busy to issue lock sync and pre-load operations.*/
#define EXTMEM_ICACHE_SET_PRELOAD_ILG_INT_ENA  (BIT(7))
#define EXTMEM_ICACHE_SET_PRELOAD_ILG_INT_ENA_M  (BIT(7))
#define EXTMEM_ICACHE_SET_PRELOAD_ILG_INT_ENA_V  0x1
#define EXTMEM_ICACHE_SET_PRELOAD_ILG_INT_ENA_S  7
/* EXTMEM_ICACHE_REJECT_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by authentication fail.*/
#define EXTMEM_ICACHE_REJECT_INT_ENA  (BIT(6))
#define EXTMEM_ICACHE_REJECT_INT_ENA_M  (BIT(6))
#define EXTMEM_ICACHE_REJECT_INT_ENA_V  0x1
#define EXTMEM_ICACHE_REJECT_INT_ENA_S  6
/* EXTMEM_IC_PRELOAD_SIZE_FAULT_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by manual pre-load configurations fault.*/
#define EXTMEM_IC_PRELOAD_SIZE_FAULT_INT_ENA  (BIT(5))
#define EXTMEM_IC_PRELOAD_SIZE_FAULT_INT_ENA_M  (BIT(5))
#define EXTMEM_IC_PRELOAD_SIZE_FAULT_INT_ENA_V  0x1
#define EXTMEM_IC_PRELOAD_SIZE_FAULT_INT_ENA_S  5
/* EXTMEM_IC_SYNC_SIZE_FAULT_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by manual sync configurations fault.*/
#define EXTMEM_IC_SYNC_SIZE_FAULT_INT_ENA  (BIT(4))
#define EXTMEM_IC_SYNC_SIZE_FAULT_INT_ENA_M  (BIT(4))
#define EXTMEM_IC_SYNC_SIZE_FAULT_INT_ENA_V  0x1
#define EXTMEM_IC_SYNC_SIZE_FAULT_INT_ENA_S  4
/* EXTMEM_IBUS_CNT_OVF_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by ibus counter overflow.*/
#define EXTMEM_IBUS_CNT_OVF_INT_ENA  (BIT(3))
#define EXTMEM_IBUS_CNT_OVF_INT_ENA_M  (BIT(3))
#define EXTMEM_IBUS_CNT_OVF_INT_ENA_V  0x1
#define EXTMEM_IBUS_CNT_OVF_INT_ENA_S  3
/* EXTMEM_IBUS_ACS_MSK_IC_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt by cpu access icache while
 the corresponding ibus is disabled which include speculative access.*/
#define EXTMEM_IBUS_ACS_MSK_IC_INT_ENA  (BIT(2))
#define EXTMEM_IBUS_ACS_MSK_IC_INT_ENA_M  (BIT(2))
#define EXTMEM_IBUS_ACS_MSK_IC_INT_ENA_V  0x1
#define EXTMEM_IBUS_ACS_MSK_IC_INT_ENA_S  2
/* EXTMEM_CACHE_DBG_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: The bit is used to activate the cache track function. 1: enable  0: disable.*/
#define EXTMEM_CACHE_DBG_EN  (BIT(0))
#define EXTMEM_CACHE_DBG_EN_M  (BIT(0))
#define EXTMEM_CACHE_DBG_EN_V  0x1
#define EXTMEM_CACHE_DBG_EN_S  0

