espressif/esp-idf/components/soc/esp32s2/register/soc/extmem_reg.h
#define EXTMEM_CACHE_DBG_INT_CLR_REG          (DR_REG_EXTMEM_BASE + 0x0EC)
/* EXTMEM_MMU_ENTRY_FAULT_INT_CLR : WOD ;bitpos:[13] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by mmu entry fault.*/
#define EXTMEM_MMU_ENTRY_FAULT_INT_CLR  (BIT(13))
#define EXTMEM_MMU_ENTRY_FAULT_INT_CLR_M  (BIT(13))
#define EXTMEM_MMU_ENTRY_FAULT_INT_CLR_V  0x1
#define EXTMEM_MMU_ENTRY_FAULT_INT_CLR_S  13
/* EXTMEM_DCACHE_SET_ILG_INT_CLR : WOD ;bitpos:[12] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by illegal writing lock registers
 of dcache while dcache is busy to issue lock sync or pre-load operations.*/
#define EXTMEM_DCACHE_SET_ILG_INT_CLR  (BIT(12))
#define EXTMEM_DCACHE_SET_ILG_INT_CLR_M  (BIT(12))
#define EXTMEM_DCACHE_SET_ILG_INT_CLR_V  0x1
#define EXTMEM_DCACHE_SET_ILG_INT_CLR_S  12
/* EXTMEM_DCACHE_REJECT_INT_CLR : WOD ;bitpos:[11] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by authentication fail.*/
#define EXTMEM_DCACHE_REJECT_INT_CLR  (BIT(11))
#define EXTMEM_DCACHE_REJECT_INT_CLR_M  (BIT(11))
#define EXTMEM_DCACHE_REJECT_INT_CLR_V  0x1
#define EXTMEM_DCACHE_REJECT_INT_CLR_S  11
/* EXTMEM_DCACHE_WRITE_FLASH_INT_CLR : WOD ;bitpos:[10] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by dcache trying to write flash.*/
#define EXTMEM_DCACHE_WRITE_FLASH_INT_CLR  (BIT(10))
#define EXTMEM_DCACHE_WRITE_FLASH_INT_CLR_M  (BIT(10))
#define EXTMEM_DCACHE_WRITE_FLASH_INT_CLR_V  0x1
#define EXTMEM_DCACHE_WRITE_FLASH_INT_CLR_S  10
/* EXTMEM_DC_PRELOAD_SIZE_FAULT_INT_CLR : WOD ;bitpos:[9] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by manual pre-load configurations fault.*/
#define EXTMEM_DC_PRELOAD_SIZE_FAULT_INT_CLR  (BIT(9))
#define EXTMEM_DC_PRELOAD_SIZE_FAULT_INT_CLR_M  (BIT(9))
#define EXTMEM_DC_PRELOAD_SIZE_FAULT_INT_CLR_V  0x1
#define EXTMEM_DC_PRELOAD_SIZE_FAULT_INT_CLR_S  9
/* EXTMEM_DC_SYNC_SIZE_FAULT_INT_CLR : WOD ;bitpos:[8] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by manual sync configurations fault.*/
#define EXTMEM_DC_SYNC_SIZE_FAULT_INT_CLR  (BIT(8))
#define EXTMEM_DC_SYNC_SIZE_FAULT_INT_CLR_M  (BIT(8))
#define EXTMEM_DC_SYNC_SIZE_FAULT_INT_CLR_V  0x1
#define EXTMEM_DC_SYNC_SIZE_FAULT_INT_CLR_S  8
/* EXTMEM_DBUS_CNT_OVF_INT_CLR : WOD ;bitpos:[7] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by dbus counter overflow.*/
#define EXTMEM_DBUS_CNT_OVF_INT_CLR  (BIT(7))
#define EXTMEM_DBUS_CNT_OVF_INT_CLR_M  (BIT(7))
#define EXTMEM_DBUS_CNT_OVF_INT_CLR_V  0x1
#define EXTMEM_DBUS_CNT_OVF_INT_CLR_S  7
/* EXTMEM_DBUS_ACS_MSK_DC_INT_CLR : WOD ;bitpos:[6] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by cpu access dcache while
 the corresponding dbus is disabled or dcache is disabled which include speculative access.*/
#define EXTMEM_DBUS_ACS_MSK_DC_INT_CLR  (BIT(6))
#define EXTMEM_DBUS_ACS_MSK_DC_INT_CLR_M  (BIT(6))
#define EXTMEM_DBUS_ACS_MSK_DC_INT_CLR_V  0x1
#define EXTMEM_DBUS_ACS_MSK_DC_INT_CLR_S  6
/* EXTMEM_ICACHE_SET_ILG_INT_CLR : WOD ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by illegal writing lock registers
 of icache while icache is busy to issue lock sync or pre-load operations.*/
#define EXTMEM_ICACHE_SET_ILG_INT_CLR  (BIT(5))
#define EXTMEM_ICACHE_SET_ILG_INT_CLR_M  (BIT(5))
#define EXTMEM_ICACHE_SET_ILG_INT_CLR_V  0x1
#define EXTMEM_ICACHE_SET_ILG_INT_CLR_S  5
/* EXTMEM_ICACHE_REJECT_INT_CLR : WOD ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by authentication fail.*/
#define EXTMEM_ICACHE_REJECT_INT_CLR  (BIT(4))
#define EXTMEM_ICACHE_REJECT_INT_CLR_M  (BIT(4))
#define EXTMEM_ICACHE_REJECT_INT_CLR_V  0x1
#define EXTMEM_ICACHE_REJECT_INT_CLR_S  4
/* EXTMEM_IC_PRELOAD_SIZE_FAULT_INT_CLR : WOD ;bitpos:[3] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by manual pre-load configurations fault.*/
#define EXTMEM_IC_PRELOAD_SIZE_FAULT_INT_CLR  (BIT(3))
#define EXTMEM_IC_PRELOAD_SIZE_FAULT_INT_CLR_M  (BIT(3))
#define EXTMEM_IC_PRELOAD_SIZE_FAULT_INT_CLR_V  0x1
#define EXTMEM_IC_PRELOAD_SIZE_FAULT_INT_CLR_S  3
/* EXTMEM_IC_SYNC_SIZE_FAULT_INT_CLR : WOD ;bitpos:[2] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by manual sync configurations fault.*/
#define EXTMEM_IC_SYNC_SIZE_FAULT_INT_CLR  (BIT(2))
#define EXTMEM_IC_SYNC_SIZE_FAULT_INT_CLR_M  (BIT(2))
#define EXTMEM_IC_SYNC_SIZE_FAULT_INT_CLR_V  0x1
#define EXTMEM_IC_SYNC_SIZE_FAULT_INT_CLR_S  2
/* EXTMEM_IBUS_CNT_OVF_INT_CLR : WOD ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by ibus counter overflow.*/
#define EXTMEM_IBUS_CNT_OVF_INT_CLR  (BIT(1))
#define EXTMEM_IBUS_CNT_OVF_INT_CLR_M  (BIT(1))
#define EXTMEM_IBUS_CNT_OVF_INT_CLR_V  0x1
#define EXTMEM_IBUS_CNT_OVF_INT_CLR_S  1
/* EXTMEM_IBUS_ACS_MSK_IC_INT_CLR : WOD ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt by cpu access icache while
 the corresponding ibus is disabled or icache is disabled which include speculative access.*/
#define EXTMEM_IBUS_ACS_MSK_IC_INT_CLR  (BIT(0))
#define EXTMEM_IBUS_ACS_MSK_IC_INT_CLR_M  (BIT(0))
#define EXTMEM_IBUS_ACS_MSK_IC_INT_CLR_V  0x1
#define EXTMEM_IBUS_ACS_MSK_IC_INT_CLR_S  0

#define EXTMEM_CACHE_DBG_STATUS0_REG          (DR_REG_EXTMEM_BASE + 0x0F0)
/* EXTMEM_ICACHE_SET_LOCK_ILG_ST : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by illegal writing lock
 registers of icache while icache is busy to issue lock sync or pre-load operations.*/
#define EXTMEM_ICACHE_SET_LOCK_ILG_ST  (BIT(24))
#define EXTMEM_ICACHE_SET_LOCK_ILG_ST_M  (BIT(24))
#define EXTMEM_ICACHE_SET_LOCK_ILG_ST_V  0x1
#define EXTMEM_ICACHE_SET_LOCK_ILG_ST_S  24
/* EXTMEM_ICACHE_SET_SYNC_ILG_ST : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by illegal writing sync
 registers of icache while icache is busy to issue lock sync and pre-load operations.*/
#define EXTMEM_ICACHE_SET_SYNC_ILG_ST  (BIT(23))
#define EXTMEM_ICACHE_SET_SYNC_ILG_ST_M  (BIT(23))
#define EXTMEM_ICACHE_SET_SYNC_ILG_ST_V  0x1
#define EXTMEM_ICACHE_SET_SYNC_ILG_ST_S  23
/* EXTMEM_ICACHE_SET_PRELOAD_ILG_ST : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by illegal writing preload
 registers of icache while icache is busy to issue lock sync and pre-load operations.*/
#define EXTMEM_ICACHE_SET_PRELOAD_ILG_ST  (BIT(22))
#define EXTMEM_ICACHE_SET_PRELOAD_ILG_ST_M  (BIT(22))
#define EXTMEM_ICACHE_SET_PRELOAD_ILG_ST_V  0x1
#define EXTMEM_ICACHE_SET_PRELOAD_ILG_ST_S  22
/* EXTMEM_ICACHE_REJECT_ST : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by authentication fail.*/
#define EXTMEM_ICACHE_REJECT_ST  (BIT(21))
#define EXTMEM_ICACHE_REJECT_ST_M  (BIT(21))
#define EXTMEM_ICACHE_REJECT_ST_V  0x1
#define EXTMEM_ICACHE_REJECT_ST_S  21
/* EXTMEM_IC_PRELOAD_SIZE_FAULT_ST : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by manual pre-load configurations fault.*/
#define EXTMEM_IC_PRELOAD_SIZE_FAULT_ST  (BIT(20))
#define EXTMEM_IC_PRELOAD_SIZE_FAULT_ST_M  (BIT(20))
#define EXTMEM_IC_PRELOAD_SIZE_FAULT_ST_V  0x1
#define EXTMEM_IC_PRELOAD_SIZE_FAULT_ST_S  20
/* EXTMEM_IC_SYNC_SIZE_FAULT_ST : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by manual sync configurations fault.*/
#define EXTMEM_IC_SYNC_SIZE_FAULT_ST  (BIT(19))
#define EXTMEM_IC_SYNC_SIZE_FAULT_ST_M  (BIT(19))
#define EXTMEM_IC_SYNC_SIZE_FAULT_ST_V  0x1
#define EXTMEM_IC_SYNC_SIZE_FAULT_ST_S  19
/* EXTMEM_IC_PRELOAD_CNT_OVF_ST : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by pre-load counter overflow.*/
#define EXTMEM_IC_PRELOAD_CNT_OVF_ST  (BIT(18))
#define EXTMEM_IC_PRELOAD_CNT_OVF_ST_M  (BIT(18))
#define EXTMEM_IC_PRELOAD_CNT_OVF_ST_V  0x1
#define EXTMEM_IC_PRELOAD_CNT_OVF_ST_S  18
/* EXTMEM_IC_PRELOAD_MISS_CNT_OVF_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by pre-load miss counter overflow.*/
#define EXTMEM_IC_PRELOAD_MISS_CNT_OVF_ST  (BIT(16))
#define EXTMEM_IC_PRELOAD_MISS_CNT_OVF_ST_M  (BIT(16))
#define EXTMEM_IC_PRELOAD_MISS_CNT_OVF_ST_V  0x1
#define EXTMEM_IC_PRELOAD_MISS_CNT_OVF_ST_S  16
/* EXTMEM_IBUS2_ABANDON_CNT_OVF_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by ibus2 abandon counter overflow.*/
#define EXTMEM_IBUS2_ABANDON_CNT_OVF_ST  (BIT(14))
#define EXTMEM_IBUS2_ABANDON_CNT_OVF_ST_M  (BIT(14))
#define EXTMEM_IBUS2_ABANDON_CNT_OVF_ST_V  0x1
#define EXTMEM_IBUS2_ABANDON_CNT_OVF_ST_S  14
/* EXTMEM_IBUS1_ABANDON_CNT_OVF_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by ibus1 abandon counter overflow.*/
#define EXTMEM_IBUS1_ABANDON_CNT_OVF_ST  (BIT(13))
#define EXTMEM_IBUS1_ABANDON_CNT_OVF_ST_M  (BIT(13))
#define EXTMEM_IBUS1_ABANDON_CNT_OVF_ST_V  0x1
#define EXTMEM_IBUS1_ABANDON_CNT_OVF_ST_S  13
/* EXTMEM_IBUS0_ABANDON_CNT_OVF_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by ibus0 abandon counter overflow.*/
#define EXTMEM_IBUS0_ABANDON_CNT_OVF_ST  (BIT(12))
#define EXTMEM_IBUS0_ABANDON_CNT_OVF_ST_M  (BIT(12))
#define EXTMEM_IBUS0_ABANDON_CNT_OVF_ST_V  0x1
#define EXTMEM_IBUS0_ABANDON_CNT_OVF_ST_S  12
/* EXTMEM_IBUS2_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by ibus2 miss counter overflow.*/
#define EXTMEM_IBUS2_ACS_MISS_CNT_OVF_ST  (BIT(10))
#define EXTMEM_IBUS2_ACS_MISS_CNT_OVF_ST_M  (BIT(10))
#define EXTMEM_IBUS2_ACS_MISS_CNT_OVF_ST_V  0x1
#define EXTMEM_IBUS2_ACS_MISS_CNT_OVF_ST_S  10
/* EXTMEM_IBUS1_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by ibus1 miss counter overflow.*/
#define EXTMEM_IBUS1_ACS_MISS_CNT_OVF_ST  (BIT(9))
#define EXTMEM_IBUS1_ACS_MISS_CNT_OVF_ST_M  (BIT(9))
#define EXTMEM_IBUS1_ACS_MISS_CNT_OVF_ST_V  0x1
#define EXTMEM_IBUS1_ACS_MISS_CNT_OVF_ST_S  9
/* EXTMEM_IBUS0_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by ibus0 miss counter overflow.*/
#define EXTMEM_IBUS0_ACS_MISS_CNT_OVF_ST  (BIT(8))
#define EXTMEM_IBUS0_ACS_MISS_CNT_OVF_ST_M  (BIT(8))
#define EXTMEM_IBUS0_ACS_MISS_CNT_OVF_ST_V  0x1
#define EXTMEM_IBUS0_ACS_MISS_CNT_OVF_ST_S  8
/* EXTMEM_IBUS2_ACS_CNT_OVF_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by ibus2 counter overflow.*/
#define EXTMEM_IBUS2_ACS_CNT_OVF_ST  (BIT(6))
#define EXTMEM_IBUS2_ACS_CNT_OVF_ST_M  (BIT(6))
#define EXTMEM_IBUS2_ACS_CNT_OVF_ST_V  0x1
#define EXTMEM_IBUS2_ACS_CNT_OVF_ST_S  6
/* EXTMEM_IBUS1_ACS_CNT_OVF_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by ibus1 counter overflow.*/
#define EXTMEM_IBUS1_ACS_CNT_OVF_ST  (BIT(5))
#define EXTMEM_IBUS1_ACS_CNT_OVF_ST_M  (BIT(5))
#define EXTMEM_IBUS1_ACS_CNT_OVF_ST_V  0x1
#define EXTMEM_IBUS1_ACS_CNT_OVF_ST_S  5
/* EXTMEM_IBUS0_ACS_CNT_OVF_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by ibus0 counter overflow.*/
#define EXTMEM_IBUS0_ACS_CNT_OVF_ST  (BIT(4))
#define EXTMEM_IBUS0_ACS_CNT_OVF_ST_M  (BIT(4))
#define EXTMEM_IBUS0_ACS_CNT_OVF_ST_V  0x1
#define EXTMEM_IBUS0_ACS_CNT_OVF_ST_S  4
/* EXTMEM_IBUS2_ACS_MSK_ICACHE_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by cpu access icache while
 the ibus2 is disabled or icache is disabled which include speculative access.*/
#define EXTMEM_IBUS2_ACS_MSK_ICACHE_ST  (BIT(2))
#define EXTMEM_IBUS2_ACS_MSK_ICACHE_ST_M  (BIT(2))
#define EXTMEM_IBUS2_ACS_MSK_ICACHE_ST_V  0x1
#define EXTMEM_IBUS2_ACS_MSK_ICACHE_ST_S  2
/* EXTMEM_IBUS1_ACS_MSK_ICACHE_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by cpu access icache while
 the ibus1 is disabled or icache is disabled which include speculative access.*/
#define EXTMEM_IBUS1_ACS_MSK_ICACHE_ST  (BIT(1))
#define EXTMEM_IBUS1_ACS_MSK_ICACHE_ST_M  (BIT(1))
#define EXTMEM_IBUS1_ACS_MSK_ICACHE_ST_V  0x1
#define EXTMEM_IBUS1_ACS_MSK_ICACHE_ST_S  1
/* EXTMEM_IBUS0_ACS_MSK_ICACHE_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by cpu access icache while
 the ibus0 is disabled or icache is disabled which include speculative access.*/
#define EXTMEM_IBUS0_ACS_MSK_ICACHE_ST  (BIT(0))
#define EXTMEM_IBUS0_ACS_MSK_ICACHE_ST_M  (BIT(0))
#define EXTMEM_IBUS0_ACS_MSK_ICACHE_ST_V  0x1
#define EXTMEM_IBUS0_ACS_MSK_ICACHE_ST_S  0

#define EXTMEM_CACHE_DBG_STATUS1_REG          (DR_REG_EXTMEM_BASE + 0x0F4)
/* EXTMEM_MMU_ENTRY_FAULT_ST : RO ;bitpos:[30] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by mmu entry fault.*/
#define EXTMEM_MMU_ENTRY_FAULT_ST  (BIT(30))
#define EXTMEM_MMU_ENTRY_FAULT_ST_M  (BIT(30))
#define EXTMEM_MMU_ENTRY_FAULT_ST_V  0x1
#define EXTMEM_MMU_ENTRY_FAULT_ST_S  30
/* EXTMEM_DCACHE_SET_LOCK_ILG_ST : RO ;bitpos:[29] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by illegal writing lock
 registers of icache while icache is busy to issue lock sync or pre-load operations.*/
#define EXTMEM_DCACHE_SET_LOCK_ILG_ST  (BIT(29))
#define EXTMEM_DCACHE_SET_LOCK_ILG_ST_M  (BIT(29))
#define EXTMEM_DCACHE_SET_LOCK_ILG_ST_V  0x1
#define EXTMEM_DCACHE_SET_LOCK_ILG_ST_S  29
/* EXTMEM_DCACHE_SET_SYNC_ILG_ST : RO ;bitpos:[28] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by illegal writing sync
 registers of icache while icache is busy to issue lock sync and pre-load operations.*/
#define EXTMEM_DCACHE_SET_SYNC_ILG_ST  (BIT(28))
#define EXTMEM_DCACHE_SET_SYNC_ILG_ST_M  (BIT(28))
#define EXTMEM_DCACHE_SET_SYNC_ILG_ST_V  0x1
#define EXTMEM_DCACHE_SET_SYNC_ILG_ST_S  28
/* EXTMEM_DCACHE_SET_PRELOAD_ILG_ST : RO ;bitpos:[27] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by illegal writing preload
 registers of icache while icache is busy to issue lock sync and pre-load operations.*/
#define EXTMEM_DCACHE_SET_PRELOAD_ILG_ST  (BIT(27))
#define EXTMEM_DCACHE_SET_PRELOAD_ILG_ST_M  (BIT(27))
#define EXTMEM_DCACHE_SET_PRELOAD_ILG_ST_V  0x1
#define EXTMEM_DCACHE_SET_PRELOAD_ILG_ST_S  27
/* EXTMEM_DCACHE_REJECT_ST : RO ;bitpos:[26] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by authentication fail.*/
#define EXTMEM_DCACHE_REJECT_ST  (BIT(26))
#define EXTMEM_DCACHE_REJECT_ST_M  (BIT(26))
#define EXTMEM_DCACHE_REJECT_ST_V  0x1
#define EXTMEM_DCACHE_REJECT_ST_S  26
/* EXTMEM_DCACHE_WRITE_FLASH_ST : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by dcache trying to write flash.*/
#define EXTMEM_DCACHE_WRITE_FLASH_ST  (BIT(25))
#define EXTMEM_DCACHE_WRITE_FLASH_ST_M  (BIT(25))
#define EXTMEM_DCACHE_WRITE_FLASH_ST_V  0x1
#define EXTMEM_DCACHE_WRITE_FLASH_ST_S  25
/* EXTMEM_DC_PRELOAD_SIZE_FAULT_ST : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by manual pre-load configurations fault.*/
#define EXTMEM_DC_PRELOAD_SIZE_FAULT_ST  (BIT(24))
#define EXTMEM_DC_PRELOAD_SIZE_FAULT_ST_M  (BIT(24))
#define EXTMEM_DC_PRELOAD_SIZE_FAULT_ST_V  0x1
#define EXTMEM_DC_PRELOAD_SIZE_FAULT_ST_S  24
/* EXTMEM_DC_SYNC_SIZE_FAULT_ST : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by manual sync configurations fault.*/
#define EXTMEM_DC_SYNC_SIZE_FAULT_ST  (BIT(23))
#define EXTMEM_DC_SYNC_SIZE_FAULT_ST_M  (BIT(23))
#define EXTMEM_DC_SYNC_SIZE_FAULT_ST_V  0x1
#define EXTMEM_DC_SYNC_SIZE_FAULT_ST_S  23
/* EXTMEM_DC_PRELOAD_CNT_OVF_ST : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by pre-load counter overflow.*/
#define EXTMEM_DC_PRELOAD_CNT_OVF_ST  (BIT(22))
#define EXTMEM_DC_PRELOAD_CNT_OVF_ST_M  (BIT(22))
#define EXTMEM_DC_PRELOAD_CNT_OVF_ST_V  0x1
#define EXTMEM_DC_PRELOAD_CNT_OVF_ST_S  22
/* EXTMEM_DC_PRELOAD_EVICT_CNT_OVF_ST : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by pre-load eviction counter overflow.*/
#define EXTMEM_DC_PRELOAD_EVICT_CNT_OVF_ST  (BIT(21))
#define EXTMEM_DC_PRELOAD_EVICT_CNT_OVF_ST_M  (BIT(21))
#define EXTMEM_DC_PRELOAD_EVICT_CNT_OVF_ST_V  0x1
#define EXTMEM_DC_PRELOAD_EVICT_CNT_OVF_ST_S  21
/* EXTMEM_DC_PRELOAD_MISS_CNT_OVF_ST : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by pre-load miss counter overflow.*/
#define EXTMEM_DC_PRELOAD_MISS_CNT_OVF_ST  (BIT(20))
#define EXTMEM_DC_PRELOAD_MISS_CNT_OVF_ST_M  (BIT(20))
#define EXTMEM_DC_PRELOAD_MISS_CNT_OVF_ST_V  0x1
#define EXTMEM_DC_PRELOAD_MISS_CNT_OVF_ST_S  20
/* EXTMEM_DBUS2_ABANDON_CNT_OVF_ST : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by dbus2 abandon counter overflow.*/
#define EXTMEM_DBUS2_ABANDON_CNT_OVF_ST  (BIT(18))
#define EXTMEM_DBUS2_ABANDON_CNT_OVF_ST_M  (BIT(18))
#define EXTMEM_DBUS2_ABANDON_CNT_OVF_ST_V  0x1
#define EXTMEM_DBUS2_ABANDON_CNT_OVF_ST_S  18
/* EXTMEM_DBUS1_ABANDON_CNT_OVF_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by dbus1 abandon counter overflow.*/
#define EXTMEM_DBUS1_ABANDON_CNT_OVF_ST  (BIT(17))
#define EXTMEM_DBUS1_ABANDON_CNT_OVF_ST_M  (BIT(17))
#define EXTMEM_DBUS1_ABANDON_CNT_OVF_ST_V  0x1
#define EXTMEM_DBUS1_ABANDON_CNT_OVF_ST_S  17
/* EXTMEM_DBUS0_ABANDON_CNT_OVF_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by dbus0 abandon counter overflow.*/
#define EXTMEM_DBUS0_ABANDON_CNT_OVF_ST  (BIT(16))
#define EXTMEM_DBUS0_ABANDON_CNT_OVF_ST_M  (BIT(16))
#define EXTMEM_DBUS0_ABANDON_CNT_OVF_ST_V  0x1
#define EXTMEM_DBUS0_ABANDON_CNT_OVF_ST_S  16
/* EXTMEM_DBUS2_ACS_WB_CNT_OVF_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by dbus2 eviction counter overflow.*/
#define EXTMEM_DBUS2_ACS_WB_CNT_OVF_ST  (BIT(14))
#define EXTMEM_DBUS2_ACS_WB_CNT_OVF_ST_M  (BIT(14))
#define EXTMEM_DBUS2_ACS_WB_CNT_OVF_ST_V  0x1
#define EXTMEM_DBUS2_ACS_WB_CNT_OVF_ST_S  14
/* EXTMEM_DBUS1_ACS_WB_CNT_OVF_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by dbus1 eviction counter overflow.*/
#define EXTMEM_DBUS1_ACS_WB_CNT_OVF_ST  (BIT(13))
#define EXTMEM_DBUS1_ACS_WB_CNT_OVF_ST_M  (BIT(13))
#define EXTMEM_DBUS1_ACS_WB_CNT_OVF_ST_V  0x1
#define EXTMEM_DBUS1_ACS_WB_CNT_OVF_ST_S  13
/* EXTMEM_DBUS0_ACS_WB_CNT_OVF_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by dbus0 eviction counter overflow.*/
#define EXTMEM_DBUS0_ACS_WB_CNT_OVF_ST  (BIT(12))
#define EXTMEM_DBUS0_ACS_WB_CNT_OVF_ST_M  (BIT(12))
#define EXTMEM_DBUS0_ACS_WB_CNT_OVF_ST_V  0x1
#define EXTMEM_DBUS0_ACS_WB_CNT_OVF_ST_S  12
/* EXTMEM_DBUS2_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by dbus2 miss counter overflow.*/
#define EXTMEM_DBUS2_ACS_MISS_CNT_OVF_ST  (BIT(10))
#define EXTMEM_DBUS2_ACS_MISS_CNT_OVF_ST_M  (BIT(10))
#define EXTMEM_DBUS2_ACS_MISS_CNT_OVF_ST_V  0x1
#define EXTMEM_DBUS2_ACS_MISS_CNT_OVF_ST_S  10
/* EXTMEM_DBUS1_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by dbus1 miss counter overflow.*/
#define EXTMEM_DBUS1_ACS_MISS_CNT_OVF_ST  (BIT(9))
#define EXTMEM_DBUS1_ACS_MISS_CNT_OVF_ST_M  (BIT(9))
#define EXTMEM_DBUS1_ACS_MISS_CNT_OVF_ST_V  0x1
#define EXTMEM_DBUS1_ACS_MISS_CNT_OVF_ST_S  9
/* EXTMEM_DBUS0_ACS_MISS_CNT_OVF_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by dbus0 miss counter overflow.*/
#define EXTMEM_DBUS0_ACS_MISS_CNT_OVF_ST  (BIT(8))
#define EXTMEM_DBUS0_ACS_MISS_CNT_OVF_ST_M  (BIT(8))
#define EXTMEM_DBUS0_ACS_MISS_CNT_OVF_ST_V  0x1
#define EXTMEM_DBUS0_ACS_MISS_CNT_OVF_ST_S  8
/* EXTMEM_DBUS2_ACS_CNT_OVF_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by dbus2 counter overflow.*/
#define EXTMEM_DBUS2_ACS_CNT_OVF_ST  (BIT(6))
#define EXTMEM_DBUS2_ACS_CNT_OVF_ST_M  (BIT(6))
#define EXTMEM_DBUS2_ACS_CNT_OVF_ST_V  0x1
#define EXTMEM_DBUS2_ACS_CNT_OVF_ST_S  6
/* EXTMEM_DBUS1_ACS_CNT_OVF_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by dbus1 counter overflow.*/
#define EXTMEM_DBUS1_ACS_CNT_OVF_ST  (BIT(5))
#define EXTMEM_DBUS1_ACS_CNT_OVF_ST_M  (BIT(5))
#define EXTMEM_DBUS1_ACS_CNT_OVF_ST_V  0x1
#define EXTMEM_DBUS1_ACS_CNT_OVF_ST_S  5
/* EXTMEM_DBUS0_ACS_CNT_OVF_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by dbus0 counter overflow.*/
#define EXTMEM_DBUS0_ACS_CNT_OVF_ST  (BIT(4))
#define EXTMEM_DBUS0_ACS_CNT_OVF_ST_M  (BIT(4))
#define EXTMEM_DBUS0_ACS_CNT_OVF_ST_V  0x1
#define EXTMEM_DBUS0_ACS_CNT_OVF_ST_S  4
/* EXTMEM_DBUS2_ACS_MSK_DCACHE_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by cpu access dcache while
 the dbus2 is disabled or dcache is disabled which include speculative access.*/
#define EXTMEM_DBUS2_ACS_MSK_DCACHE_ST  (BIT(2))
#define EXTMEM_DBUS2_ACS_MSK_DCACHE_ST_M  (BIT(2))
#define EXTMEM_DBUS2_ACS_MSK_DCACHE_ST_V  0x1
#define EXTMEM_DBUS2_ACS_MSK_DCACHE_ST_S  2
/* EXTMEM_DBUS1_ACS_MSK_DCACHE_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by cpu access dcache while
 the dbus1 is disabled or dcache is disabled which include speculative access.*/
#define EXTMEM_DBUS1_ACS_MSK_DCACHE_ST  (BIT(1))
#define EXTMEM_DBUS1_ACS_MSK_DCACHE_ST_M  (BIT(1))
#define EXTMEM_DBUS1_ACS_MSK_DCACHE_ST_V  0x1
#define EXTMEM_DBUS1_ACS_MSK_DCACHE_ST_S  1
/* EXTMEM_DBUS0_ACS_MSK_DCACHE_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bit is used to indicate interrupt by cpu access dcache while
 the dbus0 is disabled or dcache is disabled which include speculative access.*/
#define EXTMEM_DBUS0_ACS_MSK_DCACHE_ST  (BIT(0))
#define EXTMEM_DBUS0_ACS_MSK_DCACHE_ST_M  (BIT(0))
#define EXTMEM_DBUS0_ACS_MSK_DCACHE_ST_V  0x1
#define EXTMEM_DBUS0_ACS_MSK_DCACHE_ST_S  0

#define EXTMEM_PRO_CACHE_ACS_CNT_CLR_REG          (DR_REG_EXTMEM_BASE + 0x0F8)
/* EXTMEM_PRO_ICACHE_ACS_CNT_CLR : WOD ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to clear icache counter which include IC_PRELOAD_CNT_REG
  IC_PRELOAD_MISS_CNT_REG  IBUS0-2_ABANDON_CNT_REG  IBUS0-2_ACS_MISS_CNT_REG and IBUS0-2_ACS_CNT_REG.*/
#define EXTMEM_PRO_ICACHE_ACS_CNT_CLR  (BIT(1))
#define EXTMEM_PRO_ICACHE_ACS_CNT_CLR_M  (BIT(1))
#define EXTMEM_PRO_ICACHE_ACS_CNT_CLR_V  0x1
#define EXTMEM_PRO_ICACHE_ACS_CNT_CLR_S  1
/* EXTMEM_PRO_DCACHE_ACS_CNT_CLR : WOD ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bit is used to clear dcache counter which include DC_PRELOAD_CNT_REG
  DC_PRELOAD_EVICT_CNT_REG  DC_PRELOAD_MISS_CNT_REG  DBUS0-2_ABANDON_CNT_REG  DBUS0-2_ACS_WB_CNT_REG  DBUS0-2_ACS_MISS_CNT_REG and DBUS0-2_ACS_CNT_REG.*/
#define EXTMEM_PRO_DCACHE_ACS_CNT_CLR  (BIT(0))
#define EXTMEM_PRO_DCACHE_ACS_CNT_CLR_M  (BIT(0))
#define EXTMEM_PRO_DCACHE_ACS_CNT_CLR_V  0x1
#define EXTMEM_PRO_DCACHE_ACS_CNT_CLR_S  0

