espressif/esp-idf/components/soc/esp32s2/register/soc/extmem_reg.h
#define EXTMEM_PRO_DCACHE_REJECT_ST_REG          (DR_REG_EXTMEM_BASE + 0x0FC)
/* EXTMEM_PRO_DCACHE_CPU_ATTR : RO ;bitpos:[5:3] ;default: 3'b0 ; */
/*description: The bits are used to indicate the attribute of CPU access dcache
 when authentication fail. 0: invalidate  1: execute-able  2: read-able  4: write-able.*/
#define EXTMEM_PRO_DCACHE_CPU_ATTR  0x00000007
#define EXTMEM_PRO_DCACHE_CPU_ATTR_M  ((EXTMEM_PRO_DCACHE_CPU_ATTR_V)<<(EXTMEM_PRO_DCACHE_CPU_ATTR_S))
#define EXTMEM_PRO_DCACHE_CPU_ATTR_V  0x7
#define EXTMEM_PRO_DCACHE_CPU_ATTR_S  3
/* EXTMEM_PRO_DCACHE_TAG_ATTR : RO ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: The bits are used to indicate the attribute of data from external
 memory when authentication fail. 0: invalidate  1: execute-able  2: read-able  4: write-able.*/
#define EXTMEM_PRO_DCACHE_TAG_ATTR  0x00000007
#define EXTMEM_PRO_DCACHE_TAG_ATTR_M  ((EXTMEM_PRO_DCACHE_TAG_ATTR_V)<<(EXTMEM_PRO_DCACHE_TAG_ATTR_S))
#define EXTMEM_PRO_DCACHE_TAG_ATTR_V  0x7
#define EXTMEM_PRO_DCACHE_TAG_ATTR_S  0

#define EXTMEM_PRO_DCACHE_REJECT_VADDR_REG          (DR_REG_EXTMEM_BASE + 0x100)
/* EXTMEM_PRO_DCACHE_CPU_VADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The bits are used to indicate the virtual address of CPU access
 dcache when authentication fail.*/
#define EXTMEM_PRO_DCACHE_CPU_VADDR  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_CPU_VADDR_M  ((EXTMEM_PRO_DCACHE_CPU_VADDR_V)<<(EXTMEM_PRO_DCACHE_CPU_VADDR_S))
#define EXTMEM_PRO_DCACHE_CPU_VADDR_V  0xFFFFFFFF
#define EXTMEM_PRO_DCACHE_CPU_VADDR_S  0

#define EXTMEM_PRO_ICACHE_REJECT_ST_REG          (DR_REG_EXTMEM_BASE + 0x104)
/* EXTMEM_PRO_ICACHE_CPU_ATTR : RO ;bitpos:[5:3] ;default: 3'b0 ; */
/*description: The bits are used to indicate the attribute of CPU access icache
 when authentication fail. 0: invalidate  1: execute-able  2: read-able*/
#define EXTMEM_PRO_ICACHE_CPU_ATTR  0x00000007
#define EXTMEM_PRO_ICACHE_CPU_ATTR_M  ((EXTMEM_PRO_ICACHE_CPU_ATTR_V)<<(EXTMEM_PRO_ICACHE_CPU_ATTR_S))
#define EXTMEM_PRO_ICACHE_CPU_ATTR_V  0x7
#define EXTMEM_PRO_ICACHE_CPU_ATTR_S  3
/* EXTMEM_PRO_ICACHE_TAG_ATTR : RO ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: The bits are used to indicate the attribute of data from external
 memory when authentication fail. 0: invalidate  1: execute-able  2: read-able  4: write-able.*/
#define EXTMEM_PRO_ICACHE_TAG_ATTR  0x00000007
#define EXTMEM_PRO_ICACHE_TAG_ATTR_M  ((EXTMEM_PRO_ICACHE_TAG_ATTR_V)<<(EXTMEM_PRO_ICACHE_TAG_ATTR_S))
#define EXTMEM_PRO_ICACHE_TAG_ATTR_V  0x7
#define EXTMEM_PRO_ICACHE_TAG_ATTR_S  0

#define EXTMEM_PRO_ICACHE_REJECT_VADDR_REG          (DR_REG_EXTMEM_BASE + 0x108)
/* EXTMEM_PRO_ICACHE_CPU_VADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The bits are used to indicate the virtual address of CPU access
 icache when authentication fail.*/
#define EXTMEM_PRO_ICACHE_CPU_VADDR  0xFFFFFFFF
#define EXTMEM_PRO_ICACHE_CPU_VADDR_M  ((EXTMEM_PRO_ICACHE_CPU_VADDR_V)<<(EXTMEM_PRO_ICACHE_CPU_VADDR_S))
#define EXTMEM_PRO_ICACHE_CPU_VADDR_V  0xFFFFFFFF
#define EXTMEM_PRO_ICACHE_CPU_VADDR_S  0

#define EXTMEM_PRO_CACHE_MMU_FAULT_CONTENT_REG          (DR_REG_EXTMEM_BASE + 0x10C)
/* EXTMEM_PRO_CACHE_MMU_FAULT_CODE : RO ;bitpos:[19:17] ;default: 3'h0 ; */
/*description: The bits are used to indicate the operations which cause mmu
 fault occurrence. 0: default  1: cpu miss  2: preload miss  3: flush  4: cpu miss evict recovery address  5: load miss evict recovery address  6: external dma tx  7: external dma rx*/
#define EXTMEM_PRO_CACHE_MMU_FAULT_CODE  0x00000007
#define EXTMEM_PRO_CACHE_MMU_FAULT_CODE_M  ((EXTMEM_PRO_CACHE_MMU_FAULT_CODE_V)<<(EXTMEM_PRO_CACHE_MMU_FAULT_CODE_S))
#define EXTMEM_PRO_CACHE_MMU_FAULT_CODE_V  0x7
#define EXTMEM_PRO_CACHE_MMU_FAULT_CODE_S  17
/* EXTMEM_PRO_CACHE_MMU_FAULT_CONTENT : RO ;bitpos:[16:0] ;default: 17'h0 ; */
/*description: The bits are used to indicate the content of mmu entry which cause mmu fault..*/
#define EXTMEM_PRO_CACHE_MMU_FAULT_CONTENT  0x0001FFFF
#define EXTMEM_PRO_CACHE_MMU_FAULT_CONTENT_M  ((EXTMEM_PRO_CACHE_MMU_FAULT_CONTENT_V)<<(EXTMEM_PRO_CACHE_MMU_FAULT_CONTENT_S))
#define EXTMEM_PRO_CACHE_MMU_FAULT_CONTENT_V  0x1FFFF
#define EXTMEM_PRO_CACHE_MMU_FAULT_CONTENT_S  0

#define EXTMEM_PRO_CACHE_MMU_FAULT_VADDR_REG          (DR_REG_EXTMEM_BASE + 0x110)
/* EXTMEM_PRO_CACHE_MMU_FAULT_VADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The bits are used to indicate the virtual address which cause mmu fault..*/
#define EXTMEM_PRO_CACHE_MMU_FAULT_VADDR  0xFFFFFFFF
#define EXTMEM_PRO_CACHE_MMU_FAULT_VADDR_M  ((EXTMEM_PRO_CACHE_MMU_FAULT_VADDR_V)<<(EXTMEM_PRO_CACHE_MMU_FAULT_VADDR_S))
#define EXTMEM_PRO_CACHE_MMU_FAULT_VADDR_V  0xFFFFFFFF
#define EXTMEM_PRO_CACHE_MMU_FAULT_VADDR_S  0

#define EXTMEM_PRO_CACHE_WRAP_AROUND_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x114)
/* EXTMEM_PRO_CACHE_SRAM_RD_WRAP_AROUND : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to enable wrap around mode when read data from spiram.*/
#define EXTMEM_PRO_CACHE_SRAM_RD_WRAP_AROUND  (BIT(1))
#define EXTMEM_PRO_CACHE_SRAM_RD_WRAP_AROUND_M  (BIT(1))
#define EXTMEM_PRO_CACHE_SRAM_RD_WRAP_AROUND_V  0x1
#define EXTMEM_PRO_CACHE_SRAM_RD_WRAP_AROUND_S  1
/* EXTMEM_PRO_CACHE_FLASH_WRAP_AROUND : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bit is used to enable wrap around mode when read data from flash.*/
#define EXTMEM_PRO_CACHE_FLASH_WRAP_AROUND  (BIT(0))
#define EXTMEM_PRO_CACHE_FLASH_WRAP_AROUND_M  (BIT(0))
#define EXTMEM_PRO_CACHE_FLASH_WRAP_AROUND_V  0x1
#define EXTMEM_PRO_CACHE_FLASH_WRAP_AROUND_S  0

#define EXTMEM_PRO_CACHE_MMU_POWER_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x118)
/* EXTMEM_PRO_CACHE_MMU_MEM_FORCE_PU : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: The bit is used to power mmu memory down  0: follow_rtc_lslp_pd  1: power up*/
#define EXTMEM_PRO_CACHE_MMU_MEM_FORCE_PU  (BIT(2))
#define EXTMEM_PRO_CACHE_MMU_MEM_FORCE_PU_M  (BIT(2))
#define EXTMEM_PRO_CACHE_MMU_MEM_FORCE_PU_V  0x1
#define EXTMEM_PRO_CACHE_MMU_MEM_FORCE_PU_S  2
/* EXTMEM_PRO_CACHE_MMU_MEM_FORCE_PD : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to power mmu memory down  0: follow_rtc_lslp_pd  1: power down*/
#define EXTMEM_PRO_CACHE_MMU_MEM_FORCE_PD  (BIT(1))
#define EXTMEM_PRO_CACHE_MMU_MEM_FORCE_PD_M  (BIT(1))
#define EXTMEM_PRO_CACHE_MMU_MEM_FORCE_PD_V  0x1
#define EXTMEM_PRO_CACHE_MMU_MEM_FORCE_PD_S  1
/* EXTMEM_PRO_CACHE_MMU_MEM_FORCE_ON : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: The bit is used to enable clock gating to save power when access
 mmu memory  0: enable  1: disable*/
#define EXTMEM_PRO_CACHE_MMU_MEM_FORCE_ON  (BIT(0))
#define EXTMEM_PRO_CACHE_MMU_MEM_FORCE_ON_M  (BIT(0))
#define EXTMEM_PRO_CACHE_MMU_MEM_FORCE_ON_V  0x1
#define EXTMEM_PRO_CACHE_MMU_MEM_FORCE_ON_S  0

#define EXTMEM_PRO_CACHE_STATE_REG          (DR_REG_EXTMEM_BASE + 0x11C)
/* EXTMEM_PRO_DCACHE_STATE : RO ;bitpos:[23:12] ;default: 12'h0 ; */
/*description: The bit is used to indicate dcache main fsm is in idle state
 or not. 1: in idle state   0: not in idle state*/
#define EXTMEM_PRO_DCACHE_STATE  0x00000FFF
#define EXTMEM_PRO_DCACHE_STATE_M  ((EXTMEM_PRO_DCACHE_STATE_V)<<(EXTMEM_PRO_DCACHE_STATE_S))
#define EXTMEM_PRO_DCACHE_STATE_V  0xFFF
#define EXTMEM_PRO_DCACHE_STATE_S  12
/* EXTMEM_PRO_ICACHE_STATE : RO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: The bit is used to indicate icache main fsm is in idle state
 or not. 1: in idle state   0: not in idle state*/
#define EXTMEM_PRO_ICACHE_STATE  0x00000FFF
#define EXTMEM_PRO_ICACHE_STATE_M  ((EXTMEM_PRO_ICACHE_STATE_V)<<(EXTMEM_PRO_ICACHE_STATE_S))
#define EXTMEM_PRO_ICACHE_STATE_V  0xFFF
#define EXTMEM_PRO_ICACHE_STATE_S  0

#define EXTMEM_CACHE_ENCRYPT_DECRYPT_RECORD_DISABLE_REG          (DR_REG_EXTMEM_BASE + 0x120)
/* EXTMEM_RECORD_DISABLE_G0CB_DECRYPT : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: Reserved.*/
#define EXTMEM_RECORD_DISABLE_G0CB_DECRYPT  (BIT(1))
#define EXTMEM_RECORD_DISABLE_G0CB_DECRYPT_M  (BIT(1))
#define EXTMEM_RECORD_DISABLE_G0CB_DECRYPT_V  0x1
#define EXTMEM_RECORD_DISABLE_G0CB_DECRYPT_S  1
/* EXTMEM_RECORD_DISABLE_DB_ENCRYPT : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: Reserved.*/
#define EXTMEM_RECORD_DISABLE_DB_ENCRYPT  (BIT(0))
#define EXTMEM_RECORD_DISABLE_DB_ENCRYPT_M  (BIT(0))
#define EXTMEM_RECORD_DISABLE_DB_ENCRYPT_V  0x1
#define EXTMEM_RECORD_DISABLE_DB_ENCRYPT_S  0

