espressif/esp-idf/components/soc/esp32s2/register/soc/extmem_reg.h
#define EXTMEM_CACHE_ENCRYPT_DECRYPT_CLK_FORCE_ON_REG          (DR_REG_EXTMEM_BASE + 0x124)
/* EXTMEM_CLK_FORCE_ON_AUTOMATIC_ENCRYPT_DECRYPT : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: The bit is used to close clock gating of encrypt and decrypt
 clock. 1: close gating  0: open clock gating.*/
#define EXTMEM_CLK_FORCE_ON_AUTOMATIC_ENCRYPT_DECRYPT  (BIT(2))
#define EXTMEM_CLK_FORCE_ON_AUTOMATIC_ENCRYPT_DECRYPT_M  (BIT(2))
#define EXTMEM_CLK_FORCE_ON_AUTOMATIC_ENCRYPT_DECRYPT_V  0x1
#define EXTMEM_CLK_FORCE_ON_AUTOMATIC_ENCRYPT_DECRYPT_S  2
/* EXTMEM_CLK_FORCE_ON_G0CB_DECRYPT : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: The bit is used to close clock gating of decrypt clock. 1: close
 gating  0: open clock gating.*/
#define EXTMEM_CLK_FORCE_ON_G0CB_DECRYPT  (BIT(1))
#define EXTMEM_CLK_FORCE_ON_G0CB_DECRYPT_M  (BIT(1))
#define EXTMEM_CLK_FORCE_ON_G0CB_DECRYPT_V  0x1
#define EXTMEM_CLK_FORCE_ON_G0CB_DECRYPT_S  1
/* EXTMEM_CLK_FORCE_ON_DB_ENCRYPT : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: The bit is used to close clock gating of encrypt clock. 1: close
 gating  0: open clock gating.*/
#define EXTMEM_CLK_FORCE_ON_DB_ENCRYPT  (BIT(0))
#define EXTMEM_CLK_FORCE_ON_DB_ENCRYPT_M  (BIT(0))
#define EXTMEM_CLK_FORCE_ON_DB_ENCRYPT_V  0x1
#define EXTMEM_CLK_FORCE_ON_DB_ENCRYPT_S  0

#define EXTMEM_CACHE_BRIDGE_ARBITER_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x128)
/* EXTMEM_ALLOC_WB_HOLD_ARBITER : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: Reserved.*/
#define EXTMEM_ALLOC_WB_HOLD_ARBITER  (BIT(0))
#define EXTMEM_ALLOC_WB_HOLD_ARBITER_M  (BIT(0))
#define EXTMEM_ALLOC_WB_HOLD_ARBITER_V  0x1
#define EXTMEM_ALLOC_WB_HOLD_ARBITER_S  0

#define EXTMEM_CACHE_PRELOAD_INT_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x12C)
/* EXTMEM_PRO_DCACHE_PRELOAD_INT_CLR : WOD ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit is used to clear the interrupt by dcache pre-load done.*/
#define EXTMEM_PRO_DCACHE_PRELOAD_INT_CLR  (BIT(5))
#define EXTMEM_PRO_DCACHE_PRELOAD_INT_CLR_M  (BIT(5))
#define EXTMEM_PRO_DCACHE_PRELOAD_INT_CLR_V  0x1
#define EXTMEM_PRO_DCACHE_PRELOAD_INT_CLR_S  5
/* EXTMEM_PRO_DCACHE_PRELOAD_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to enable the interrupt by dcache pre-load done.*/
#define EXTMEM_PRO_DCACHE_PRELOAD_INT_ENA  (BIT(4))
#define EXTMEM_PRO_DCACHE_PRELOAD_INT_ENA_M  (BIT(4))
#define EXTMEM_PRO_DCACHE_PRELOAD_INT_ENA_V  0x1
#define EXTMEM_PRO_DCACHE_PRELOAD_INT_ENA_S  4
/* EXTMEM_PRO_DCACHE_PRELOAD_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The bit is used to indicate the interrupt by dcache pre-load done.*/
#define EXTMEM_PRO_DCACHE_PRELOAD_INT_ST  (BIT(3))
#define EXTMEM_PRO_DCACHE_PRELOAD_INT_ST_M  (BIT(3))
#define EXTMEM_PRO_DCACHE_PRELOAD_INT_ST_V  0x1
#define EXTMEM_PRO_DCACHE_PRELOAD_INT_ST_S  3
/* EXTMEM_PRO_ICACHE_PRELOAD_INT_CLR : WOD ;bitpos:[2] ;default: 1'b0 ; */
/*description: The bit is used to clear the interrupt by icache pre-load done.*/
#define EXTMEM_PRO_ICACHE_PRELOAD_INT_CLR  (BIT(2))
#define EXTMEM_PRO_ICACHE_PRELOAD_INT_CLR_M  (BIT(2))
#define EXTMEM_PRO_ICACHE_PRELOAD_INT_CLR_V  0x1
#define EXTMEM_PRO_ICACHE_PRELOAD_INT_CLR_S  2
/* EXTMEM_PRO_ICACHE_PRELOAD_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to enable the interrupt by icache pre-load done.*/
#define EXTMEM_PRO_ICACHE_PRELOAD_INT_ENA  (BIT(1))
#define EXTMEM_PRO_ICACHE_PRELOAD_INT_ENA_M  (BIT(1))
#define EXTMEM_PRO_ICACHE_PRELOAD_INT_ENA_V  0x1
#define EXTMEM_PRO_ICACHE_PRELOAD_INT_ENA_S  1
/* EXTMEM_PRO_ICACHE_PRELOAD_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bit is used to indicate the interrupt by icache pre-load done.*/
#define EXTMEM_PRO_ICACHE_PRELOAD_INT_ST  (BIT(0))
#define EXTMEM_PRO_ICACHE_PRELOAD_INT_ST_M  (BIT(0))
#define EXTMEM_PRO_ICACHE_PRELOAD_INT_ST_V  0x1
#define EXTMEM_PRO_ICACHE_PRELOAD_INT_ST_S  0

#define EXTMEM_CACHE_SYNC_INT_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x130)
/* EXTMEM_PRO_DCACHE_SYNC_INT_CLR : WOD ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit is used to clear the interrupt by dcache sync done.*/
#define EXTMEM_PRO_DCACHE_SYNC_INT_CLR  (BIT(5))
#define EXTMEM_PRO_DCACHE_SYNC_INT_CLR_M  (BIT(5))
#define EXTMEM_PRO_DCACHE_SYNC_INT_CLR_V  0x1
#define EXTMEM_PRO_DCACHE_SYNC_INT_CLR_S  5
/* EXTMEM_PRO_DCACHE_SYNC_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to enable the interrupt by dcache sync done.*/
#define EXTMEM_PRO_DCACHE_SYNC_INT_ENA  (BIT(4))
#define EXTMEM_PRO_DCACHE_SYNC_INT_ENA_M  (BIT(4))
#define EXTMEM_PRO_DCACHE_SYNC_INT_ENA_V  0x1
#define EXTMEM_PRO_DCACHE_SYNC_INT_ENA_S  4
/* EXTMEM_PRO_DCACHE_SYNC_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The bit is used to indicate the interrupt by dcache sync done.*/
#define EXTMEM_PRO_DCACHE_SYNC_INT_ST  (BIT(3))
#define EXTMEM_PRO_DCACHE_SYNC_INT_ST_M  (BIT(3))
#define EXTMEM_PRO_DCACHE_SYNC_INT_ST_V  0x1
#define EXTMEM_PRO_DCACHE_SYNC_INT_ST_S  3
/* EXTMEM_PRO_ICACHE_SYNC_INT_CLR : WOD ;bitpos:[2] ;default: 1'b0 ; */
/*description: The bit is used to clear the interrupt by icache sync done.*/
#define EXTMEM_PRO_ICACHE_SYNC_INT_CLR  (BIT(2))
#define EXTMEM_PRO_ICACHE_SYNC_INT_CLR_M  (BIT(2))
#define EXTMEM_PRO_ICACHE_SYNC_INT_CLR_V  0x1
#define EXTMEM_PRO_ICACHE_SYNC_INT_CLR_S  2
/* EXTMEM_PRO_ICACHE_SYNC_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to enable the interrupt by icache sync done.*/
#define EXTMEM_PRO_ICACHE_SYNC_INT_ENA  (BIT(1))
#define EXTMEM_PRO_ICACHE_SYNC_INT_ENA_M  (BIT(1))
#define EXTMEM_PRO_ICACHE_SYNC_INT_ENA_V  0x1
#define EXTMEM_PRO_ICACHE_SYNC_INT_ENA_S  1
/* EXTMEM_PRO_ICACHE_SYNC_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bit is used to indicate the interrupt by icache sync done.*/
#define EXTMEM_PRO_ICACHE_SYNC_INT_ST  (BIT(0))
#define EXTMEM_PRO_ICACHE_SYNC_INT_ST_M  (BIT(0))
#define EXTMEM_PRO_ICACHE_SYNC_INT_ST_V  0x1
#define EXTMEM_PRO_ICACHE_SYNC_INT_ST_S  0

